[{"id": 1234, "text": " \" Islam isn't in America to be equal to any other faith but to become dominant. The Koran should be the highest authority in America  and islam the only accepted religion on Earth. -- Omar Ahmad  Co-Founder CAIR (Council on American Islamic Relations)\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Read the koran and sunnah. Islam is a vile ideology solely dedicated to the conquest and subjugation of humanity under the sharia. No true muslim can EVER be loyal to a kuffar (unbeliever) nation and its manmade laws. These are not refugees  they are foot soldiers of the Al Hijrah (immigration jihad)  a fundamental tool of islamic civilizational conquest for 1400 years. Muslims do not assimilate  they colonize  and this UN/OIC sponsored invasion must be stopped. Our national and cultural survival depends on it.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Illegal ALIEN not illegal immigrant! Is a drug dealer an unlicensed pharmacist? No. Then this guys is an illegal alien. Let's use the correct terms if you're going to talk about people. ;)\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop the Al Hijrah at all costs. muslims are coming to colonize  not assimilate. They can never be loyal to the U.S. Constitution  only to sharia. They are all carriers of the pestilence known as islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Vote Ted Cruz for President 2016 the candidate who truly is against the muslim takeover. Trumps suggested temporary ban is a  political sleight of hand  he has muslim friends  refuses to say he would uphold the constitution against sharia law  trump stands on the side of sharia blasphemy law against free speech as in garland texas  you're being conned by the political scientists media to vote for the negotiator who has no ideals incompatible with islam.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Obama is a Muslim and was born in Africa. His whole mission is to start the downfall of America by allowing the invasion of illegal immigrants and Muslim terrorist!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The last sentence in the article is very telling and explains this mayor's crazy/criminal behavior. ''People are very supportive of her because she took a stand  and is serving the people who elected her.'' So by serving the people who elected her  I'm assuming they mean her illegal immigrant constituency.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Obama is little Baracky Muslimseed  doing all he can for the Al Hijrah (immigration jihad). Muslims do not assimilate. Muslims cannot be loyal to a kafir (unbeliever) nation and its manmade laws. The koran divides the world into dar al islam (house of islam) and dar al harb (house of war). The nonmuslim world is fit for only one purpose: conquest and subjugation under islam's yoke  with all obeying the sharia. While the radicals work for this day by violence  the moderates do it by stealth  imposing the sharia agenda bit by bit. Both camps end in the same place: global domination by islam. We all need to fight this islamic invasion of America tooth and nail  or the Brotherhood's goal of destroying their miserable house from within  in a kind of grand jihad will come about.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" As does the repulsive  shameful  ignorant  incredibly insane San Francisco city council  the judge who set a ridiculous bond for the recent illegal immigrant felon who killed a truck driver and fled the scene and Jerry Brown. I can't wait till the hammer is lowered on these frekin nuts.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Hello it's ok not have permission to buy a gun for a mentally ill person. But people who get paid to protect the people of this country like FBI and law enforcement like police force  look like they also mentally ill. After shooting in the high school this gunman had a escaping plan. Just like that now FBI and Police they also having escape plans for not able to do their jobs. God bless America.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Quran book of evil against everything not islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Now here is an example of elected officials with blood on their hands. You have liberal politicians who protect illegal immigrants and American citizens who were murdered by some of those illegal immigrants. Then liberals want to accuse conservative politicians who accept donations from the NRA of having blood on their hands after mass shootings even though no NRA members have committed mass shootings. Let that logic sink in\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" If Dems don't give Preident Trump what he wants he needs to start reducing the numbers of DACA immigrants to receive the right to stay. Start with going backto only the number that signed up under Obuma.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Your typical peaceful islamic terrorist cults\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Trump only hires immigrants at his properties and everything is made overseas with the Trump name on it. His wife got her citizenship under the Einstein act that allows nobel prize level people in and her parents are the result of chain migration. Don't tell me there are still people out there who believes anything he says. He laughs about lying to our allies  leaders. This country is a mark and a joke to him. Then along came Mueller.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" obama's white house might have enough muslim members to be considered a terrorist organization..I bet an investigation would prove it....stop islam..stop obama.....\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Both parties flip and flop!!! Lol Democrats and Republicans are insane to the definition. Both parties have been working for illegal immigrants and other illegal activities for year. Vote both parties out of every office and out of town\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If you Google her net worth her and her husband is worth 195 mil she wants illegal immigrants to work on her vineyard in California for cheap and hope to get votes look it up\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Great Idea I heard today was to remove all the illegal immigrants off welfare and use the money for the wall\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Yes I agree with President Trump  Don't give in to these lying liberal democrats Build the wall stop illegal immigrantsGod bless save America\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" muslim any islamist religon is a threat  to the world nd obama do not even see it only if he was kill b one muslim then we all will se it obama is  too blind to see that\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" No  they are not for sport shooting. They are for stopping bad guys. Including corrupt politicians who trample on our rights! Those who would  through subterfuge  usurp the rights of a free people. Risk testing the resolve of Patriots.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I am so much disappointed  how could possibly stupid troll commenters make any humor of this event  and making fun refering to recent gun shootings.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I think that a lot of these countries know it is a way to make the US go bankrupt which is the road we are on. The United States can not sustain the immigration rates that we are allowing to come in now. The jobs in this country should be for American and not people from outside the country. Alot of immigrantts send all or most of their money back to their home country and do not spend it here. I often wonder about the stupidity of the American that they can't figure this out and wonder what is happening to this country.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Peters has become delusional. The 2A has nothing to do with sport shooting. It's about citizens being able to oppose tyrannical government. He has really gone off the deep end.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Construction is now manned by low wage illegals. They don't care about quality. This disaster is the result of Chinese crap steel and immigrants who cut corners\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" western pedophiles are condemned  but islamic are protected .. how  does that happened ?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Round s has gotten rich off of the bringing in all the immigrants he can . He cares less for the people of South Dakota. Hell he pulled a Hillary on his partner to keep his scam going and money in his pocket  .\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Way to many shooting going on In A short period of time .....The Democrats Are pushing Gun Control to farther their far left Agenda trying to control peoples gun rights......BE AWARE......they will do Anything to get their way......Even stage killings.....YES THEY ARE THAT EVIL...OUR WORST ENEMIES.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Opinions are like a$$holes Peters everyone has one  yours stinks especially bad. I only use my AR for target practice in a licensed shooting range. You are a disgrace to the uniform  not hard to see why you never made full colonel.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Legal immigrants  yes! Merit based  yes! Criminal invaders  no!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" and islam is the enemy...stop islam..stop obama.....and supporting obama..is supporting terrorism.....dont say  you didnt realize it......\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This whole shooting is way too fishy. From the cowardly deputies to the incompetent FBI  to the sheriff ignoring over 30 calls prior to the tragedy. It appears it was a pre-planned event by the LEFT as a gun grab tactic. After all abortion alone tells us the LEFT has no problem murdering innocent kids.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Everything is about political expedience. A bunch of hypocrites. If most immigrants voted Republican  the Democrats wouldn't give a hoot about them. It's all about numbers and securing a voting bloc!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Islam.......there is no such thing as radical. Islam is Islam and is the problem. They have one aim  that is the establisment of sharia law and a caliphate. The will destroy all Kafir. 1400 years of history  and 270 000 000 million dead tells the real story of islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Obama threatened to obstruct and has called for obstruction. If you think all of these shootings are just random  think again. 45 calls to the FBI about this kid before the shooting...Then when a sheriff who is a Hillary supporter was found doing and saying off-the-wall stuff about the shooting now he has refused to meet with Congress. Yeah  tell me another lie.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Mow the lawn Nancy to cut down on immigrants crossing illegally?? Really Nancy? Go back to you mansion and read your grandchildren another fairy tale. By the way  my wife and I love our crumbs.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" he is an idiot. We have little domestic population growth. The reason the babyboom led to such a post wartime boom was because of babies!! Clothing--housing--cars--schools-teachers-doctors--cycle gets bigger and bigger. Schools are contracting now because student populations are decreasing. If we have major job growth--we will need immigrants--EDUCATED immigrants--to fulfill the demand--until our welfare leeches can learn to read and write  and be taught marketable skills.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This may be exactly what it takes to get rid of the Death Cult islam. They are being much more insideous now  though. Pretending to be our friends while despising us in their hearts.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Its another Diversion..That's what the Democrats do..Every time something starts looking good well watch out cause the Left will create some kind of chaos to get off subject..Still Just like the Las Vegas shooting..like it never happened..Covering up the corrupted an blaming the innocent...Even News get off balance..Its not suppose to happen on Fox remember Fair an Balance....\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" could we please get a leader that will wipe islam from the earth?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" People are so stupid! There's nothing wrong with being an immigrant  most people are immigrants or dirive from an immigrant. Only the full blood native Americans aren't. If the government was going to kick out immigrants  they would have to leave too. Like Bill Clark said  come in the front door. Become a citizen  get a job and earn the things you want.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Sentor Cruz is right on target. Legal immigrants good  illegal immagrants bad. If you can't follow the law to come here  you will not obey the laws when you get here.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I don't recall any democrat blaming Odumbass for ALL the school shootings while he was president yet he did NOTHING for eight years!!! Trump is proactive and is actually doing something about it!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If the hilldabeast wins there will be a revolution in America this isn't the America it used to be .we can't just let anybody in here anymore.wake up people we must defeat the  isis radical islam in the name of God jesus christ amen\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" the vile cunts in the NRA  are trying to divert the attention away from  the fact that the NRA don't give about children and love every mass shooting so they can peddle their vile propaganda about a good man with a gun is the only one to stop a bad man with a gun\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Illegal immigrants should have to wait 15 years before they can vote. Then pay back taxes. Not be eligible for entitlement s either. Would Democrats still care about them? Would they still want to be here?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" WRONG! Try how Donald Trump misleads the nation on his new immigration principles. Trump hired 70 more immigrants for his Golf courses and hotels. You and Trump can give all the people all the bullshit you want. Some won't believe you or Trump and some will say It's OK because it's for Donald Trump\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Excellent reminder of where things could go! California and Sanctuary  cities do not speak for the rest of Americans anymore than the KKK and racial laws during the Civil  Rights movements.and the illegal laws that accompanied them! Illegal immigrants do not belong here  they are illegal. If immigrants want protection  and then do what you need to become legal and then I will welcome them!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" If the majority of immigrants were future voting Republicans the liberals would have had the wall built long ago  placed very strict vetting in place long ago & voter ID would have been in place long ago whether legal or illegal. These Demorat politicians have No Moral Values  No Common Sense.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Take the Democrats guns and let all illegal immigrants move in with them  so they can list them as dependents.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" How come your good ole buddy  Obummer didn't do something while he was in office? He's had more mass shooting than any other president.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So she wants Muslims to destroy and burn everything until we are submissive to the devil.  . I mean islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I hate to ruin liberals day but a shotgun can do way more damage in a mass shooting. Go eat more tide pods and play your call of duty\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I love how they are so \\\"concerned\\\" about gun control. Why don't they ever talk about the hood rats in Chicago who kill kids everyday by drive by shootings and even sometimes on purpose. What are they doing about that? Bernie and Hilary and the rest of the nut jobs are always quiet about that. The Democrats don't want to help. They just ramble on to get more votes.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" yes. islam hates. more than any religion in the world.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Why did you change your mind Dumbo? Oh  yes  it's because now a Republican is saying what you said  so it must be wrong! Bill Clinton said the same things in a State of the Union spech and got a standing ovation. But now  with a Republican in charge  suddenly all the mind numbed Liberals have change their mind. Hard to understand. But  like the brilliant Nancy Pelosi said  We can't charge illegal immigrants with anything until they do somethiing illegal. Say what?/\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Donald Donnelly What do they do in Chicago  LA  NY  etc? Just keep shooting each other! They don't do anything in CHG  LA & NY. Liberal sanctuary cities that don't report the actual news.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Oh you and your semantics. Jeez. Stop pandering for applause its degrading. Look at the issue and stop pointing your finger about whos  not saying islamic  or genocide or terrorist blah blah blah theor words\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Well one thing students should start at no cost is a open dialogue set in school without media and Hollywood creeps and parents. Just students talking to students about picking up guns and coming to school to shoot other students. Talk about mean kids  bullies and let students know if their having problems let's talk about it. You can't shift the blame on to others or guns. The real issue in school shooting is why  and kids killing kids. No one wants to talk about this  like a march in protest will stop gun shootings!!! Please  if someone wants a gun they can get one through street contacts...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" If they are firing state rep aids for telling the truth about crisis actors then they are hiding a lot and sheriff Israel is connected to big DNC political tools\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" And when is the hanging???? Heck I really don't even know the name of the moron that did the shooting but I am very sure is was not the NRA.......Maybe a good public hanging would show a demoralizing of  a killer and stop the next guy from all the attention.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" But that was when she was pretending to give a rat's rear about her neighbors and fellow American Citizens. Now  she's pretending to give a rat's rear about the illegal immigrants... because the nut jobs in California are trying to give them the vote.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" AMERICAN POLITICIANS - WAKE UP NOW!! EXTREME CASE IN POINT - Angola Outright BANS Islam  All Mosques To Be DESTROYED. Hollywood types and the Obamanator and his cronies should move there right now to see their template for American implementation!! NEWSFLASH - THE EU ARE SENDING REFUGEES BACK TO TURKEY WITH TURKEY'S AGREEMENT as reported in the financial times. DO NOTHING AND WE WILL SEE HOW BADLY DO YOU WANT AMERICANS TO HATE YOU?? http://www.jewsnews.co.il/2016/03/03/angola-outright-bans-islam-all-mosques-to-be-destroyed/\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" These corrupted liberals are hypocrites . Look at This liberal  Diane Feinstein  yrs ago saying the same damn thing that our wonderful president Trump  is saying now  about the illegal immigrants  crossing our borders. Democrats  are so wishie washie it's ok for them to say these things about the illegal immigrants here in America but Lord  help if a Republican  says the same thing . Come on Americans  lets stand together  a get rid of these corrupted liberal politicians.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" WE do NOT want religious pluralism with islam! Only this POS muslim in OUR white house wants that for his own benefit. I hate that our white house is housing so many muslims and I can't wait until we can clean house.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" And let's look at facts for just a second! Not one single mass shooting or the like have been committed by a member of the NRA! Almost all of the mass shootings have been committed by democrats so let's ban democrats first and see if that works!!! Hear how dumb that sounds? !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Toss out the dead votes and the illegal immigrant votes and it won't be close! DemocRAT started with 100 000 head start! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ok tell Trumpy to hire Americans not immigrants on work visas!!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Where are the 1.9 millions pairs of baby shoes representing the Children murdered by Planned Parenthood since the shooting at Sandy hook?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" You know part of the reason the economy has tanked  because illegals make $$$ under the table keep what they need to exist in this country and send the rest to their home country therefore not spending or reinvesting into the economy. The millions and millions of dollars sent out of the country the dollar is worth less and less. Time to vote the politicians out that support immigration or open borders. The French gave us the statue of liberty that represents immigrants coming to America  give us your tired  poor  hungry will feed  clothe  and support you from the taxpayers and give you a better life than what you had in your homeland but you're free to still support the homeland. Long story short  Give that sumbitch (statue of liberty) back to the French and close the borders.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Now stop the islamist and those calliong for the destruction of Israel.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Dems have no problem with abortion. But let mass shootings happen and all of a sudden they care about life\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Get it done Trump!! We need the immigration laws overhauled!! Stop the worthless people who just want to come over here and mooch off our system! Bring in the immigrants that can actually speak English and actually add value to this great country!! We wouldn't have all these isis problems and all these other terrorist problems if the laws were hella strict!!! I have always thought CNN was a bunch of morons...out of touch with reality andd always promoting their own agenda!!! Love this clip...shows how ignorant some of the press is! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Ok where did you all get your numbers from? 7000 children haven't died from guns or mass shooting since sandy hook. Morons\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Where do you all think all the diseases eradicated years ago are coming from? Yep  that's right the same sh!tholes as the immigrants.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Acosta is an idiot....  the majority of Americans want to deport all illegals parents and children and no amnesty for DACA.....and no immigrants until illegals are gone\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I can't blame one mass shooting on an NRA member but I can name a bunch committed by registered democrats. How about we just take guns away from crazy liberals ð ¤£\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Illegal immigrants has nothing to do with race you ignorant dipshit. It is about entering a country without permission. Look up the ICE number yourself you liar.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Now wait a second  overwhelming majority of children killed are from gang violence in the inner cities run by Dems. I think it's 227 school students killed in mass shootings since Columbine.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" 22 known armed encampments of islamic extremists in this country now training with combat assault weapons just waiting for gun restrictions in this country.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Are you still supportive of the racist POTUS? https://www.washingtonpost.com/politics/trump-attacks-protections-for-immigrants-from-shithole-countries-in-oval-office-meeting/2018/01/11/bfc0725c-f711-11e7-91af-31ac729add94_story.html?utm_term=.3cb3e3988b4b\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" So why wasn't this done for other schools    oh    I see    rich kid school has shooting and they are more important  then the others cause they are spoiled rich kids..\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Spineless  corrupt like the rest of them. Whatever benefits them liberals is what goes  forget the American people. I really can't stand this man! So plastic! Even had crocodile tears over those illegal immigrants. Please...ð \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" He was bullied in school  considered an outcast  shunned by his piers  rough home life...not surprised he turned out like he did but maybe instead of going out tomorrow and protesting guns  all these highschoolers can stay in and befriend some of these shunned kids that need friends...just a thought of how highschoolers can actually effect change  because nothings going to happen on the gun issues  if Sandyhook wasnt able to do anything  this last shooting doesnt have a chance. P.S. he should get the death penalty...take a life  lose yours...should be taught in elementary schools along with the bill of rights.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Weird. So  the FBI and DOJ are doing a good job? You think they are trustworthy? Cause investigating the investigators means they aren't  right? Despite the hypocrisy of your post Senator  focus on all mass shootings  terrorists  murders  pedophiles and men who assault women with the  same enthusiasm. Focus\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" What? They are illegal immigrants that can apply for a visa to go to school. When our children get free education and benefits they can as well as a citizen of the United States. Morons both of them\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" and days after the shooting  truth is  no one cares. The only people who are dragging this on is the left  who are now using children to push their cause. I feel sorry for the hundreds killed in Chicago. According to the left  unless you are a school and a assult rifle  they do not give a fuk\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" white man pulls a trigger 59 dead 527 injured thoughts and prayers. white man pulls trigger 24 dead 29 injured  thank God for man with Gun who showed up after shooting happened  we all need to carry guns  thoughts and prayers. Brown guy blows off his balls  only injury no deaths We must act decisively in dealing with the threat of radical Islamic terrorism  and Congress and the administration should swiftly respond with a comprehensive  bold  and effective strategy to combat this violent extremism at home and abroad  SMDH\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I still say we need to hire someone to piss on this guy's head three times a day for the rest of his life. That'll give a moment of pause to those future undesirables thinking of shooting up schools.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I feel terrible for anyone that has lost a child to this kind of violence  but the anger and ire seems directed at Trump  but where was all this anger towards Obama when the numerous school shootings occurred during his tenure  and he did absolutely nothing  why was there no outrage towards him?? ?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Only when we ban islam  can we minimalize islamic terrorism. I've said it for years and i've seen nothing that has changed. Islam is an evil ideology. History has shown that followers of islam have a much higher probability of becoming violent and committing acts of terrorism  than any other ideological group of people on earth. The study of islam is conducive to evil and acts of terrorism. Ban it and this country will be a much safer place for all.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop with your hypocrisy (NumbersUSA)... You never mention the undocumented immigrants working in all of trumps businesses\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Look enough is enough with all these mass shooting s. Why are people bringing up Obama. He should have done something then but this is now and Trump is in charge so either he does something or it will be up to the next President because this will happen again it's not a matter of if it's a matter of when.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I don't think he deserves the death penalty because first of all he wasn't alone in this. There we at least two other shooters plus where is the video footage of him actually shooting a gun. One eye witness said she was walking next to him in the hallway while they heard shooting in another corridor. This is a load of horse crap if you ask me.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" We're all Damn immigrants in this so call America  or are you'll Native Americans. The problem is not immigrants  the real problem is  greed mix with power and authority. This country has given too much power to the rich who don't care about immigration  status  religion but their pockets.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Well Obama pledged his support to radical islamic terror with what $150 000 000 000.00 of the citizens money. Why hasn't he lost his citizenship or for that matter why is even free after that treason ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So many people still blaming Obama. Obama couldn't fix mass shootings so now Trump has a chance. I honestly think none of you actually care about a solution... you'd rather just complain about Obama and Liberals.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Death penalty is to good for him  he needs to be put to death by shooting him 17 times one for every kid that had to experience the fear of them being shot lay an dying  and the 17th shot into him should finally be the one to take him instantly...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Well I'll say it we need to kick out your illegal immigrants in our country they're breaking federal law and you're damn right I support ice law enforcement to do their job get these criminals out of here\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This terrorist flew in on an airplane. He didn't cross the wall from Mexico. You are a hypocrite you Canadian born and of Cuban immigrant  imbecile. #noWALL\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Obama spoke with the shooting survivors and offered support for gun control. What trump  did do that Obama didn't was take 30 million in donations to support their agenda.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" The trouble with a lot of these illegal immigrants they break our laws.here and they don't get punished for it like we do they just ship their asses back to Mexico or where ever then they end up right back over here!!! Sorry but can't stand Mexicans!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" It's time to fight crime-let teachers \\\"shoot back\\\"! Then you'll see a drastic reduction in mass shootings in \\\"gun free zones\\\"!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" its islamic terror   drop this radical crap as if its just a few of them. mark my words   when their numbers grow they will gain confidence and start more and more of their garbage. god forbid if we allow them to keep coming here breeding like rabbits   it will be our demise .\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If they want to honor shooting victims then ALL of Chicago should be dark !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I'd like to know something. If I had a concealed weapon on me in a gun free zone and a mass murderer came in and started shooting and I shot him and stopped him  would I be arrested and jailed? !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Kate's law is xenophobic bullshit. So many mass shootings this year by US men with a history of abuse. Far scarier to me.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Chicago mass killings? Liberals >> \\\"Meh...ð  \\\". Mass shooting anywhere. Liberals >> \\\"OMG GUNS ARE HORRIBLE! BAN THEM! ð ®ð ®ð ¡ð ¥ð ©ð «ð ¤ð  ð £ (over-acting)\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Oh look at all the melt downs  where was your outrage when the democrats made the school shooting about gun control just seconds after it happened? Where was your compassion when you were parading children around for your political agenda? Spare me your false morality!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Your hysteria over one person who committed one crime is laughable  Senator. Hilarious that you & Fox  hyperventilate over this case  all while ignoring the fact that the majority of undocumented immigrants aren't criminals at all. Get up off  your butt and do something good and positive for a change. Allow the DACA dreamers to get their lives in the USA back  fund CHIP for American kids healthcare instead of screeching about this case  do something about the opioid crisis instead of constantly pandering to the right wing and sucking up to crooked Donald  the renown sexual harasser.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Hmm with all the school shootings that happen under Obama's watch why didn't he do something like this. Oh I know why  because he does not care.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" How is this woman showing racism Norma?? Her son was murdered by an ILLEGAL Immigrant!!! Period!! Let me see how you feel if an illegal immigrant killed one of your relatives. Congress needs to get off their asses and I force our laws of the land! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" More children are killed while texting while driving  walking  taking stairs  etc than in school shootings. I wonder if Eminem has the same view about abolishing cell phones?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Iran is filled with evil serpents as leaders! I was deployed  in 79 and 80 during the hostage crisis  the one thing we knew then  and we must not forget now  they are our enemy! They have no reason to be honest about anything  and are usually doing the opposite of what they tell you  as shown during Carter's embarrassing debacle in trying to negotiate the release of our people! 8 of our brothers died in the desert trying to rescue them from the country that to this day shouts  death to America in the streets!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I am so proud of our President and all he is doing for this country. He opened the doors of the White House for grieving students and parents and listened to them. I love how he listens to America. The president before did not even bring up these issues despite there being more shootings when he was president. This is our president taking action to help America.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Remember  Ted Cruz wants to tie the hands of local police when dealing with immigrants. That makes us all less safe. He doesn't care a whit about the rule of law. He has no principles.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I can't stand the crocodile tears. He says he didn't want the texts to go viral but wanted to share them with the world...Uhhh....pretty sure that's kinda bigger. Also  where were all the kids from Obama's and Bush's terms crying for gun control after school shootings? I know liberals were definitely crying but now it seems liberals are trying everything to get what they want  like using a school shooting to promote their agenda. Pathetic...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Really? I think the Northern Michiganders might disagree after the shooting at CMU where the killer was on the run. He was only caught because he didn't think about how cold it was when he shed his clothes so he wouldn't be detected. Jumping on a train almost naked was a good clue. I was ready to shoot the SOB if he reached my home and he was headed my way. I have a right to defend myself from the youth of today that have no sense of purpose.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" No hell  no ! she is  not  showing  damn  racism ! The point  is  he had no business  in America   period ! Do you  not  understand  the  word illegal   ! If you  are stating  this  is  racism   you're  also  stating  it's against  a  race  of people   that's  bs ! We as Americans  are  sick  and  tired  of  illegal  immigrants  flooding  America   do it the right  way   then you're  a  citizen ! It has absolutely  nothing  to  do  with  race   so stop  acting  like  the dumbocrats   using  the  race  card   instead  of  telling  the damn  truth   because  the last time  I  checked  illegal  is not  a  damn  race   it's a bunch  of  damn  criminals ! Also    doesn't  Mexico  have  a  wall  and some  of  the  stiffest penalties  on earth  for  entering  Mexico  illegally   so enough  of the racist  bs ! You  bunch  of  damn  hypocrites ! Now that  is factual   because  that  is  exactly  what  you'll  are !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ted  are you on drugs. Jeff Sessions is reason that Hillary Clinton is still walking the streets of America shooting her mouth off. This women is the definition of a traitorous criminal. She walks around a flips us off because she knows Trump and Sessions will never prosecute her. The only thing Sessions shows the US has a totally corrupt judicial system where if you are powerful enough the laws of this country doesn't apply to you. Sessions should have been fired immediately after the pathetic display last week to the House committee. Obviously you are no better.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The left wants to blame all this on President Trump  then why didnt they blame obummer for sandy hook or the more than 25 other mass shootings during his presidency? Its called Liberal Hypocrisy! At least Trump is going to the people to hear their grievances and ideas  he is talking with law enforcement to get their input  and he is talking with students and teachers to hear their thoughts. At least this president is doing something!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" It's hilarious how he can criticize others about this issue but back on his Marshall Mathers LP the song \\\"I'm Back\\\" had a verse that went like: \\\"I take seven kids from Columbine  stand 'em all in a line  add an AK-47  a revolver  a nine. A MAC-11 and it ought to solve the problem of mine. And that's a whole school of bullies shot up all at one time\\\". He had many more school shooting references in that album because he too was bullied and knew what it felt like to have that rage. But it angers me and makes him look hypocritical when he says political stuff like this to stay relevant.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This guy is a nut. This has been debunked. He counted things that had nothing to do with illegals to inflate his numbers. Numbers impress conservatives and the bigger the number the better they like them. This is where Fox news got it's info and reported the same numbers. Even legal immigrants are forbidden by law to get any kind of welfare or food stamps for the first five years  This is propaganda used to rouse the rabble. Besides  Economics is VooDoo science. If we do this then this should happen   we hope this will happen. Remember trickle down. One reason it didn't work as planned. We could not force big business to use the breaks to expand and produce jobs. So they didn't do that. They took the breaks  counted it as income  paid higher dividends to stock holders and gave themselves bonuses for a job well done. The expected tax cuts will be the same thing with a different name.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Another crazy white man doing a mass shooting ð   Can you push for tougher gun laws?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So they imposed a 3 day waiting period  (to give the person time to cool down) thinking it would prevent in the heat of the moment shooting...that did not prevent in the heat of  moment shootings. People are the problem and this #resist crap has fueled a lot of aggression. Thanks dems\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Ya know i really dont think eminem has room to talk. Eslecially since he raps about rape  murder  drive bys  drugs  and brags about shooting people\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" retard alert ! what do you want to bet he has immigrants in his family as well  he dont look like a native american to me  shut up and sit down in your corner  lol\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I have been a fan of Eminem since 1998 but come on he is the last person who can take the morol high ground on gun violence... He has got rich rapping about it and even made fun of the columbine shooting. that much that he used the lyrics again in rap God\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Ted Cruz is so dumb that he can't think of a single thing besides praying in the face of mass shootings. Here's something to pray for: let's vote this POS out of office in November of 2018.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Mental illness by definition would include all liberals. Their way of thinking is totally skewed. All of the mass shootings have been committed by registered democrats.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is a country of LEGAL immigrants. . The illegals are the ones costing Americans money. Too bad the tards on here can't tell the difference between illegal and legal... lol\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The first problem there that I see is this as an illegal immigrant receives from the United States government $4 for every $1 they pay in taxes first off they don't pay taxes. Why should they receive anything from our government except a one way ticket back to their country if you're illegal it's breaking the law. Are you going to pay me if I rob a bank I broke the law so pay me for doing that. Are the American people that stupid or is it just our government allowing stupid things to happen.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Food for thought! It seems to me that every mass killing in the US  every suspect has been on the FBI watch list! From the world trade center to Orlando night club to all the school shootings! Doesn't the Clintons control the fbi! They lost the election and tried to get Trump impeached but it has turned to them! So increase in killing before the mid term election! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Somebody please tell him that the guns are actually to protect our kids from participation trophy winning  tide pod eating  CNN watcher  abortion lover  bathroom insecure  revolted liberals. They are the ones shooting or kids. Not NRA members.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" These incidents are pretty rare  but if that makes sense  why doesn't Texas have more rational gun laws to protect us from the average crazy white man responsible for more gun violence and mass shootings?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Too bad the stubborn Dems don't understand this. Latest figure $600 billion on immigrant benefits  education and incarceration. I guess we to hit them (Dems) on the head so they get the idea ! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Fact: More guns  both legal and illegal = more gun deaths. Get ready for more of these and school shootings thanks to the NRA and the cowards in the GOP who are owned by them.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" They call it 'gun control ' but it's not. It's people control. REMEMBER  It's not that they hate guns  they hate the PEOPLE who have guns. They don't want to hear about changing the CULTURE that contributes to these shootings. Because then THEY will be JUDGED about the way they continue to conduct their lives  music  video games  movies  etc.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Complete bullshit. If I were Trump I would reroute every single immigrant to Washington State. That way his lack of vetting can come back to hurt that judge personally. Make that bastard reap what he sows.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Im glad and hope he does im tire of seeing immigrants come here get welfare and a good home and destroy it live like they suffering and carrying loads of stuff back plus money to Mexico and surport the drug carntel imight not spell good cauze i typin fast but im not blind what i see and know not saying all that way but to get the bad weeded out its a start so get real or shut up trump president we try your ways i dont work if trump fails its cause u treasonous basters not want him to succeed and its cause u greedy self center and stupid to think we people dont see whats going on you stand one day in judgement and see how that works for you\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" What  is every shooting headline news now?? Why don't they cover all the shootings in Chicago where they have the strictest gun control in the country? Yes  Chicago  Obama's home town.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" http://www.crazyshit.com/cnt/medias/54145-new-isis-video-1-bug-eyed-brutality\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" It seems like most of the people who commit these mass shootings seem to be isolated individuals. Calling these troubled individuals crazy like the people in this Fox segment just did will probably get you put on a list  if you know what I mean.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I support immigrants. I like to save money. I want to stop criminals from crossing illegally  often carrying the cartels drugs. So yes  of coarse I support this. People who break the law to get here should be rounded up and sent home period. And people who harbor them and give them work can have the choice to go with them or go to jail. All the immigrants I know feel the same way. They applied for  worked hard for  and attained citizenship and are welcome. Illegals are criminals and if allowed to stay  it's a slap in the face to immigrants.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Well. I guess it's time for Rick Scott to step in and ban guns from law abiding plant workers now. That'll stop the hate and shootings in the plant area.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I'm working class. I work with immigrants and refugees at my job every day. Some of the finest people I know. You sir  should shut that scrunched up butt hole you call a mouth.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" When is (fox news and NumbersUS) ever going to talk about all the undocumented immigrants working in trumps vineyards and motels ð  .... Hypocrites\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Take  the guy who done the shooting and  put him out in front  of all the public  and a low the family  s to stone him to bring  pain up on him  I the court  system  will put him in jail for life they will feed him give him medical  treatment  and who knows  what  else  he breaths while the victim  s are not here to live  a normal life  capital  punishment  should be number  one in America  as you see it in court  the victim s loss while the murder  win he keeps  his life\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Americans  that object to the Trump policy would never let these immigrants move in with them and pay for everything for them to survive. Yet the cry and scream and whine that this is an unfair policy. Bunch of freaking bleeding hearts with absolutely no interest in maintaining security or in some other way protecting America by not letting bad people into our country . They must have absolutely no regard for our safety. Oh and by the way this is temporary!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Dems are against it bcuz its OBVIOUS they cant get a STRAIGHT AMERICAN vote and remain in office. Their IGNORANCE is understood and not accepted. They have no choice but to go to less educated immigrants and illegals\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Personally as wicked as left are  I believe they set up these shootings for their agendas  hard to imagine their evil go that far  but I believe they would .\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Courts don't have jurisdiction over immigration the POTUS is given this power by our constitution. Title 8 U.S. Code 1182  Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States  he may by proclamation  and for such period as he shall deem necessary  suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants  or impose on the entry of aliens any restrictions he may deem to be appropriate.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Fear mongers. Mental illness has been a factor in most of the shootings as well as them being registered Democrats. Does that mean that being a Democrat is a mental illness? Possibly.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Don't try to make guns look evil; they can't pull their triggers. It's evil people who pull the triggers who are evil. Guns have been around for thousands of years and there were no mass shootings. It's the way the younger generation has been raised that it the problem. They are never to blame for anything...just like the obamas and clintons. It's always somebody elses dault.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" How many shootings a day in Chicago?......and nobody blinks an eye\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" So your argument excludes Iran  but you're still okay with it? And yes  Bagdad is still run by our allies  with US military there for support. Sudan still has a central government. Syria still has areas controlled by Trump's buddy Assad. I haven't heard any threats from the Houthis in Yemen. And Somalia  we've had entire communities of Somali immigrants for decades. This blanket ban was nothing more than security theater that's turned into a shit show.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" how dare immigrants speak english and be able to find work in an english speaking country like the United State. we only want certain kinds for diversity sake. that's how cnn thinks  because it makes them feel better about themselves. even though it's B.S. FOR GODS SAKE jim think before you open your pie hole.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Another shooting--what the hell\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Instant channel change whenever Fox Fake News rolls out their zero credibility liberal sewage. FFN never met a shooting they did not like to sell more commerical$. When there is a DUI Liberals blame the driver  When there is a Bombing they blame the Terrorist  When there is a shooting Liberal Sewage blames the Gun.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I wonder if Tucker will ever address the issue of all the undocumented immigrants working on Trump's Vineyard and motels.. it looks to me that Trump and Tucker with the rest of the GOP are just playing everybody... And the fact that (NumbersUSA) hasn't even addressed the issue of all those undocumented immigrants working in Trump's businesses tells me that they are also involved in deceiving us and distracting us from the real issues that is corrupt government\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Christians dont hate gays you moron. Yall just say that to anyone that disagrees with you. Wanna experience gay hate talk to the followers of islam. Christians just dont agree and morons like you bash them. Muslims kill and torture gays and yall are like  oh ok dont want too offend you    morons! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is insane drivel. There has always been hate speech about our presidents  just watch any history program. All countries have violent media and video games  but we are the ones with the mass shootings. The thing that stands out the most is easy access to powerful guns. There are other issues  but that's the big one.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" WE sure as HELL don't need any H-2B visa immigrant workers  period!! Why not give those jobs to the American Citizens who are out of work?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" But didn't the shooter know shooting people is illegal?? Maybe we should make people aware of these laws. Surely they don't know it's Illegal or they'd stop. LOL. #liberalthinking\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Don't you know Greg that if you put up a video of Trump shooting someone in the head the Trumpsters would all just go who cares? They deserved it! Go Trump!? They don't listen to reason regarding the big phony Trump.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" hell even Bill Clinton is smart enough to know we just can't let all these illegal immigrants in. He spoke about this problem and the liberals loved it. Trump says the same thing and they hate it. And Hillary even said we need a wall. Democrats today are nothing but home grown terrorists that need to be dealt with.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" The FBI knew about this guy a month ago and never followed through. They were also warned about the Pulse Shooting madman. They did nothing. ?????? What the hell do they do??? Mental illness is the issue here. He used a gun but the cause was definitely mental illness and Pulse and this most recent school shooting could have been avoided. The FBI failed to do their job.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" It's amazing of stupid CNN reporters can be. I remember many many years ago back in my Country  the private school that I attended  we had many immigrants from around the world that attended that school. And one of the rules the school had was  before a foreign student  who didn't speak English can take up whatever course they wanted  they have to take up a one year course in English first. Nobody ever accused the school of being discriminatory against none English speaking students  because they all knew they were in a Country  where English is the first language  and the school had the right to make speaking English the rule before none English speaking student take up their main courses.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If the Second Amendment had not been infringed upon there would have been armed citizens at the school who could have and would have been able to shoot back at the shooter thus the shooter would have probably been discouraged to not even commit the mass shooting in the first place  and even if he did he would not have killed and injuried so many people. This shooting happened because of the Democrats who have violated the Second Amendment of the United States Constitution. The Democrats who have violated the Second Amendment of the United States Constitution should be prosecuted as being accessories to this crime.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I am very upset by Donald Trump's position on torture. He has said that he believes in enhanced torture and in murdering the families of terrorists. Sure  breaking the arms of a terrorist's four-year-old daughter or shooting an infant in the head would be an effective way to get a mom or dad to talk  but are we ready for this? Are we becoming like Nazi Germany? (Maybe Trump can make the uniforms for our new SS officers at one of his off-shore clothing factories.) Trump's boast that he will get the members of our military to do as he says is frightening. Will he torture them too if they refuse to obey? Are we supposed to ignore the hate speech that pops out of Trump's mouth and assume that he doesn't really mean it? That sounds too risky for me. I want an alternative to the rantings of a madman. I am voting for Marco Rubio.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Jim Acosta is a moron  immigration into our country should be controlled  and immigrants should speak English and be able to support themselves. Only makes sense  no free ride we can't afford. 20T debt.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" All white people are church shooting mass murderers they shoot church's and schools and movie theater because they are all racists the right wing republicans are thieves looking for loop holes to avoid paying taxes that's why they send there companies over seas how is that for truths... Just because u throw in a fact with a bunch of lies don't turn those lies into truths\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Every shooting that results in large casualties occurred in places where no one can shoot back for minutes. The Democrat lunatic in Scalies' case also had an AR 15  but was stopped rather quickly. So  is the problem really guns or gun-free-zones?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They are not immigrants  they are illegal fkn aliens get it straight! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" More dem spinsored shootings. Life is expendable tp these folks...at least YOUR life is..not theirs#! Hide & watch...gonna be more more more\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Yeah  prisons are just packed with illegal Mexican immigrants. /sarcasm\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Democratic Party is a complete sham   they are now saying President Trump should change the gun laws   they have been in power for eight years and did nothing and there has been mass shooting in that period the same ref DACA they could have been resolved the problem but did nothing. Now they are making both these things political . Typical do not let this Party fool you in the mid term elections.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I find it funny that every shooting is reported wildly but mostly unreported that there is serial bomber in Texas...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" We need immigrants who are skilled- whether they be doctors  engineers  Journeyman/Master plumbers. welders  electricians  mechanics etc who WANT to be Americans meaning they love what America means AND want to be a part of this great country. We don't need socialist America hating welfare sucking illiterate garbage.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Thank you Ann Coulter! Politicians and  media can not  stand  and report   the truth because  they're afraid to lose popularity and votes.The mayor of NYC or any politician  disagreeing  with Donald Trump' s statements about the illegal/legal immigrants  from Mexico  is political .DeBlasio   a progressive/liberal/communist   probably sees himself as a future candidate for the WH and hopes to get  those Mexican  votes.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" But but but!! It's what dems do!! They always talk about guns first because they don't really care about the victims. They have to be reminded that the real tragedy is the dead and not the guns. They hear about a shooting and thier little nipples get stiff and start spewing stupid gun control crap. Guns don't control the idiot shooting it.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I wonder how many shootings occurred pre-internet\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" We have a lot more to worry about than illegal immigrants. We have a president that's an idiot!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" @Dana Perino people kill people. Guns don't kill prople. Please see this as a mental health problem not a gun problem. STOP  sensationalism with the shooting. A crime was committed. STOP politicalizing this tragedy.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" he is biggest hypocrite liar who ever sat in oval office .. he has asked for more immigrants to work his resorts this year than he did last year and all years prior... what a clown\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Why did the democrats start this campaign two hours before this shooting? does it make you wonder? its like back to the future! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Idiots.. has nothing to do with semi's or guns.. tobacco and fast food kill more ppl but no one says anything about that... maybe if these parents stopped letting their kids play these video games of shooting everyone this nonsense would stop... I'd like to see someone do the research and find out when these shooter video games got popular and compare to when these shootings started to happen\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Yes immigrants made what America is now but not the kind that are coming in now. Freeloaders terrorist drug dealers murderers rapist and so much more.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This shooting was set up by our liberals in the government. The shooting never happened and no one actually died. Just like in Sandy Hook\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Is Michael Star Hopkins a total imbecile ? Pres. Trump playing into the hands of terrorists because he suggests the program that BROUGHT this killer into the US as an obsolete bad bill because it imports non-vetted immigrants ? We may assert that this lottery based bill was not prophetic since it was drafted nearly a decade before 9-1-1   but a bad bill- absolutely BAD for this current time. Mr. Hopkins needs to understand that we the people don't buy his ideas of welcome and be a neighbor as the cure for murder by an ISIS operative. RIDICULOUS !! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I got an idea! If we want all these shootings to go away stop putting it on the news showing the body counts like it's a competition. I blame the media for this problem. Every single time these idiots make the top news story what happens we go right to gun control. People naturally get pissed and they go out and make the gun companies rich.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" When you tell a partial truth  it's no different than a lie. Illegal immigrants account for only a small percentage of the perpetrators of violent crime in this country. Trump is like Hitler  he plays on your fears.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Anyone else notice that it's Democrats who want gun control BUT it's also Democrats doing the mass shootings? Let's let that sink in a bit....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I don't blame the United States for this I blame a useless group of countries that meet and talk and do nothing to simply supply a continent of people water and food shame on this collection of useless countries they stand silent whenever there is a crisis\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" WRONG Pinocchio Pelosi. Your claim of assault weapons used  here's the actual statistics  24.6% mass shootings  47.9% Handguns.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" All these illegal immigrants need to be sent back . Our countries safety is first. The previous president did what ever he could to ruin this country and devide us all . He has done a Damn good job of that. He should be stripped of all his pension and benefits\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Keep America safe!!!! Oh but let all of the immigrants in  all of them. Nooo who cares if he has a criminal history  let him in!!!!! Nancy Pelosi needs to be muzzled\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Osama totally screwed this country up...he should be tried for treason. He has put this country in harm's way financially  militarily  and has severely compromised its security. Our borders are weaker than they ever have been and Congress is constantly blocking Trump's efforts to re-secure this country by vetting the borders and minimizing illegal immigrants into our country.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Reco Harris...it's black people going around shooting up neighborhoods killing babies  elderly  parents  anyone that happens to be in the line of fire\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So stupid Again it's not Legal Guns or Legal Gun Owners that are doing the shootings or killing! How stupid can you be????? These guns these criminals are using are illegal not one gun used was a legal gun.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The United States is the ONLY country in the WORLD that puts up with this crap...NO OTHER country kisses immigrants asses like we do...no wonder we are a laughing stock...no job no life no money no way of earning money !!!?? come to the US we will provide for you over our own hungry homeless disabled our Vets....you can get free food free shelter  a free house car come one come all !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" If you know so much about firearms why do you refer to an AR-15 as an automatic weapon. If you don't know the difference between an M-16 and an AR-15 shut the hell up. Mass shootings have been committed by mentally ill registered Democrats. Maybe we should ban all Democrats from voting.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" All of that is caused by humans.. That entire region listed here is Boko Haram and islamic fundimentalists.. Wanna solve this famine.. Kill the islamists who created it..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I'm starting to feel sorry for Jasper. You're going to cause an identity crisis for this proud dog. I think you should have to wear the costumes you put on him. It's for a good cause but poor Jasper.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" You know  President Trump has his flaws  as we all do  but I have to say  he gets stuff done relatively quickly. How many school shootings were there during the obama regime? What did he do about any of them besides incessantly talk talk talk about what a tragedy they were? President Trump does not play. When he wants something done  he gets it done. How refreshing!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I remember when I was in high school kids having rifles in their trucks  they even had shooting clubs for kids  what has changed  not the guns but the kids and society  who has pushed the edge of society to change? The democrats  so who is really to blame for the demise of civility? The democrats\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This is just stupidity. We are all immigrants you  DAMN idiots. This is not about numbers it is about the law and the Constitution and this country was built by immigrants and slaves. We are who we are because of immigrants. Use your DAMN brain and educate your DAMN self.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Well they are also the ones who enjoy killing millions of unborn children. Oddly they have nothing but love for radical islamic muslum terrorists. Go figure\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Yes! Sick of having more people come into this country that I as a tax payer and worker have to constant support. Get the lazy people that are Americans and immigrants off their asses and make them work no freebies to all these fat lazy asses! I see it everyday. They drive nicer cars then me  the own businesses yet I have to pay for their medications. Bullshit! I have health insurance and still have to pay about $100 every Dr visit  because I have a $3 000 deductible. That would be thanks to Obamacare and all this slugs sucking off of us.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Support law enforcement?. Alright that shooting at that school had law enforcement sitting right outside while they were inside getting shot... The only way to support the law enforcement that day would have been to have given them all a spine and remove that long yellow streak running down their backs...... Just saying....\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The irony of you people shitting on that guy when your argument this whole time is to literally have armed guards at schools to prevent shootings. Here we had an armed guard and it did fuck all  but will you admit that plan is fucking stupid? Of course not  you'll just rage at the deputy and act like someone else would do better.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Haven't you people figured it out yet. They use the foreign workers B.S. to bring in people who they will use against We the People. A so called foreign worker doesn't give a rat's azz about you  your family or this country. They would think nothing about doing you  your family or relatives in. That holds true for illegals and immigrants. Why do you think Obama and his butt buddies were and are still hell bent on disarming We the People. If you can't see that  then you deserve to lose all that you have worked hard for.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Please address mental illness first . It is the root of all mass shootings.. Make schools the hardest targets next .....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" LMAO. Get rid of gun free zones... which are democratic brain farts... Nearly every mass shooting occurs at gun free zones...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" so you're the only country where this sort of shit happens and you really are all looking for what's to blame  what to fix? maybe it's the meds  maybe it's video games  maybe it's immigrants  maybe it's guns  maybe it's mental health  who knows? too bent on red vs blue and blue bs red to actually do anything. i'll tell you what's wrong : EVERYTHING. Mental care and good medication is prohibitive  your frontier cowboy culture celebrates lone saviors  everyone has access to weapons easily  poverty and isolation is rampant and your cops find violence easier than dialogue. America is the land of freedom - for those who have the means to afford it. For the rest of us  there's Colt.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I've filled out paperwork for every gun I've ever bought....what's with this background crap ? Oh and if the Broward co PD had done their job this shooting would never had happened. But we need some new laws. Dumbest crap I've ever seen. Think a criminal cares about this new background check ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Typical liberal hypocrisy in action! They are pissed because Trump pulls out of the climate agreement ( I'm not totally happy with but I complete feel we were getting the worst end of the deal  especially since the worst polluter gets a pass until 2030 ) and they also are pissed because conservatives want to stop the flow of illegal immigrants. Which one is it snowflakes? Sustainable climate or refugees and illegal immigration? This man is a liberal professor so don't come back with  it's just some conservative bullshit!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" See this is the reason most shootings occur in Democratically control cities and states. So they cam have the Criminal Democrats like DWS and this Moron lecture America into giving up our Rights....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I love how quick you are to credit trump for the uptick citing immeasurable factors  like \\\"consumer trust and optimism\\\" but choose to blame others for any type of decline when in reality he hasn't done much to influence either yet. Most of his policy hasn't gone into effect and the massive debt that he has ushered in will be blamed on a different administration. By the way  who do you think enables these \\\"gamblers\\\" you speak of. Trump rolled back the post financial crisis rules and protections. Go ahead and keep using buzzwords like \\\"Rothschild\\\"  \\\"Illuminati\\\"  and \\\"Soros\\\". It's always easier to blame some boogeyman right?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" The unconvinced are the same people who want to let illegal immigrants vote but think it's wrong for Russians to interfere with an election. I declare I do not know how they get their shoes on the right foot...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" 95% of a mass shooting is in gun free zones. All mass shootings were done by registered demos. All gun control laws are endorsed by demo's. I think the left is trying to protect itself from itself.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" It was all a F*** plan! 1. No celebrations this weekend! The 1st year anniversary. 2. #ReleaseTheMemo what memo? We are busy with other fake crap\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Lol. Another huge loss of time and $$$. And now you know why the Parkland shootings and Stormy Daniels has been front and center for the last week. They knew all along the collusion stuff was crap  and might eventually lead back to the DNC AND HILLARY.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Is this idiot a Republican or Democrat? I suspect he is democrat but if he is Republican he has just kissed his political career goodbye  the very idea of giving jobs to immigrants when we have plenty of unemployed North Carolinians out of work .What the hell are you thinking Senator?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Another gun free zone  another crazy Democrat with guns  another mass shooting  resulting in the loss of innocent lives. Gun free zone insures maximum deaths as there will be no returned fire. You can't change crazy Democrats  maybe it's time to secure schools.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Yeahhhhhh  considering that immigrants are more likely to have a college degree than our own citizens I'm going to have to call bullshit on this.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Police caught a terrorist from Saudi Arabia planning on doing a shooting at a women march in Indianapolis too. Stay safe everyone and alert.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I have the best idea on how to handle illegal immigration. Deport all the stupid Dumpocraps that put them before honest immigrants and American citizens.....problem solved.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The mass majority of school shootings have been committed by whites. We need ban them from schools until we can figure out what's going on...\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I especially love this one  SO true! Everyone need to throw away the political corectness and admit that islam is the same unacceptable ideology as nacism or communism. Until then we wonÂ´t get anywhere.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" What a bunch of bone heads!! If all the immigrants moved out  where do you think we we would all go to find our food?? To the fields of course  providing the crops didn't rot before most of the lazy butts got off the couch to get it. Too many today are too good to get there own food from the vine as it were. I think  my foreign wife now a US Citizen  and I  may just leave these lazy goats to there own lazy ways and live much cheaper and Happy in an asian land. The US IS getting more & more petty every day! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Darvelle Phillips ... Yea because no school shootings happened when a Democrat was in office? Let's not forget Newtown the worst yet with Barak Obama as president. This isn't a political debate.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Then why did many of his songs with Dr Dre and Snoop Dog sing of shooting and gangs? One could even hear sounds of shooting in the background of those songs. EMINEM IS A HYPOCRITE.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Build that wall  what all the illegals do not realize if they were not here those murders would never have happened. My grandpa was an immigrant but he did it the legal way. Yes I am one of these Americans who are sick of supporting illegals.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I will bet that the kid that did the shooting  nor his family   are NRA members. NRA members are typicaly very responsible. It's oddball democrats and liberals that get thier hands on guns that do this stuff\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Yep... nothing should make you feel safer after a mass shooting than having people try to force you to give up your protection.. fuck em\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" And stupid liberals want to keep these violent pieces of illegal alien crap here. Let's start to hold politicians and protest leaders accountable for breaking the law by supporting unlawful immigrants. Sanctuary cities are unConstitutional and must not be funded or accepted by true  loyal  and patriotic Americans.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" One could even say Eminem's songs and lyrics birthed a gang   violence and shooting mentality in the minds of youth. Didn't random shootings begin with gang members in our society and escalated with violent rap? Now these same rappers are rapping against guns-- the very thing they previously promoted in songs?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The only Country in THE WORLD with school shootings  is the US. And your best answer for this is more guns.... HALLELUJA youÂ´re stupid\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Wow didn't you republican dumbasses just vote a woman in office in Georgia who said on television that she didn't believe in a livable wage. But you have the audacity to blame the immigrants for lower wages. What a bunch of idiots!!!!! Hell look at what you republicans done in Missouri lowering minimum wage. Good luck in keeping employees in your state. On the same day Minnesota announced it was raising minimum wage to 15.00\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ellen needs to get up off of her high horse. Can anyone guess how many NRA members have been involved in mass shootings? That's right 0. When is this puppet of the DNC going to realize we the people know a puppet and hypocrite when we see one. How can you seriously lecture anyone when you are the real Slim Shady.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Just take him behind the school and plant a lead seed in his head. Save us the trouble and him the notoriety of being a scum bag of school shooting history.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Says the guy that has over 100 songs about shooting someone with a gun  let alone strangling his wife and his mother. He even rapped about blowing up the world trade center after it happened. Saying they meant to hit his buildings. Don't get me wrong  I like many of his songs but he is a hypocrite now.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Allowing illegal immigration that has no interest in being an American citizen is signing your own death warrant everything we value will be destroyed by these immigrants and when you finally wake up to the fact you are being overrun and everything you know is gone it will be up to you to fight your way out or surrender your soul to islam or what I like to call it hell on earth... hope you decide to stop it now before it is too late\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" And in his honor  after being killed by an illegal immigrant  they are going to make another city a sanctuary city! How disrespectful! God bless his family! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Amazing how he didn't seem to have alot to say about gun control when Obama was in office and Sandy Hook  San Bernardino and the Pulse Nite Club shootings happened. Where was the outcry for gun control then  and what did Obama do about it.... NOTHING!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Media is a joke anymore. They do not care about laws broken they are as evil as Hillary by feeding the people lies and more lies. They even have their fact checkers cater to them. the crisis in America of division media is at the root of it. Who feeds information to the media that is lies? Clinton  FBI  the political leakers and buddies who scratch each others backs. We need to trash the old media and start with new outlets that believe in printing the facts not subjective garbage.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" And the respect of its citizens that served our country I feel like we're all being forced out by immigrants thanks a lot Congress and Senate I hope North Korea blows up Washington and kills are you foreign loving bastards\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ok  I'll be that guy... Isn't texas the largest population of immigrant muslims....  \"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Like the kid that brought a bomb to school and wrote isis on the building   this didn't make the news either...funny how it doesn't fit the leftist media agenda.... It's not about a white person or a gun\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Nancy Pelosi ignorance for colonizing illegal immigrants into United States for build global third world inside United States. Nancy Pelosi fault for opening the borders like in California state. Time for Nancy Pelosi to be removed from leadership.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Come on fools  we need to be politically correct  so we bring in that million immigrants  put them on welfare  then take more monies away from the wealthy and middle class to make sure they will be all right.e\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" People who say the only reason they bring immigrants in  is because  lazy Americans don't do these jobs are simpletons. They fail to understand the concept of wage depression. You see if I grow strawberries and no one wants to pick my fields for 8.00$  I won't let my strawberries rot  I will raise my wages to 9  10 hell even 12$ . But of course  Ii can be a corrupt bastard and pay off a politician who in turn will let in immigrants come in who will do the job for 8$ . and thus you set up a machine that promotes wage depression. I'm sorry I'm not stupid enough to reduce my standards of living to that of a third world shithole where these people come from. Hell to them it's like moving up several pay tiers. living jam packed like rats in a house is better than their old lives.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is fake  set up by Trump and the Koch brothers. Everyone involved are crisis actors.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I feel so sad for the family. Nancy and the rest of the Democrats should be proud that they want this illegal immigrant.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" We need for our own people to get off their asses and get jobs. Today I saw a young woman panhandling a short distance from three places with hiring signs posted.Can't blame that on immigrants.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" That what I've been saying. Our government needs to stop supporting these illegal immigrants with food stamps  welfare  free healthcare and free education\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Democrats only care about illegal immigrants because they see them as a voting base in 20 or 30 years. They don't really care about anyone except themselves. Look at what they've done to black people in the last 50 years. Lots of promises and no progress. But Lyndon Johnson was right when he said  we'll have these n*****s voting Democrat for the next 50 years. It's just what Democrats do.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" R u stupid. Immigrants harvest our food  clean our hotels  take our lawns and do jobs the lazy butt Americans choose not to work. Technology has replaced 45 percent of factory jobs. By 2025 technologies will replace over 65 percent of factory jobs. Get educated be informed and stop blaming  hard working immigrants who work for minimum wage and work hard.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Most of these comments are delusional. The fact is most Americans shy away from jobs that immigrants take on. Look at the building industry. Few young people are interested in construction - especially home building and remodeling. I spent 7 months remodeling a home in Tennessee. Virtually every American I hired turned out to be a disappointment. Most wanted easy inside work for crazy money. Some simply quit showing up. This is why Hispanic workers have co-opted this industry. Bottom line- if you don't want immigrant workers in your country  start having babies that turn into men instead of snowflakes and rednecks.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" If that's the case  then do all that without wasting money on a wall... almost all illegal immigrants overstay  visas.. this wall is just a way to pass on taxpayer money to private contractors.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Wow  Illegal immigrants are eligible for Welfare  and there are people in America that believe that!?!?! Wow.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The only way wages are really ever going to go up in the America if we get rid of these illegal immigrant assholes and the sorry-ass white human race quit being so f****** greedy\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Could be the drunk driver was illegal immigrant criminal?! Because of the Stupid sanctuary city  they rather protect the criminals instead the innocents ppl or law enforcement.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" The center for immigration studies. Sounds like a research name but is and always has been an organization dedicated to removing immigrants. Fox of course would never point out that it's information is a one-side biased source since it fits right in with them.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" It is common sense but the demon-crats won't let that happen because it means more money for them and more votes  that is why they are for the immigrants  to control the house. So instead of looking out for us they are only for their agenda. That is why we have to try to get every conservative to do the right thing for every U.S. citizen now  so we can keep the votes and have control of the house to make America great.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Thank you Jerry Brown. You must be an idiot  and they elected you. How are you ever going to be safe with all the illegal immigrants in your state.....go California  keep paying for them  and their antics.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The wall is necessary but let's not see it as a panacea; it needs to be one part of a much bigger plan. The majority of those here illegally didn't come here illegally; they simply stayed after they were supposed to leave. This makes expatriation at least as important as the wall. Remember  the vast majority of third world immigrants  both legal and illegal  become socialist voters generation after generation  and they are the reason a traitor like Obama could get elected  and Hillary almost got in. We are at a tipping point: it will not take many more streaming in for America to become a socialist dictatorship. This is a foregone conclusion  if we do not drastically change the course we are on.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Illegal immigrants  CAN NOT  collect welfare except thru loopholes regarding US born children they have. There  ARE some services (k - 12 education  aid for pregnant mothers and babies  etc.) Some individual states actually give more assistance to illegals than the Federal government. But to be realistic that will never happen  the liberals would never allow it\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" And what's the latest news about the Las Vegas shooting? What have the FBI and local cops found out about  'The Deadliest Mass Shooting in America' after all this time? We've heard a lot of 'rumors' but that story seems to have been dropped off the radar. Was it a 'False Flag'  (another government sponsored terrorist attack designed to elicit public opinion on a matter)  or just a case of some rich Whacko that hated Trump supporters?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I don't mind helping USA citizens with food stamps and welfare til they get back on their feet but I am so so against helping illegal immigrants - my forefathers came to America and started working immediately and got their citizenship - each person who enters the USA needs to apply for citizenship when they arrive! or go home!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Why in the world do we bring in 1 million immigrants? That's crazy! The United States needs to take care of the United States citizens first and above all else!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" So the democrats known for using the blacks the illigal and legal immigrants and now they of to using the school kids. Wow.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" There is agreement among researchers that illegal immigrants who come to America with modest levels of education (not completing high school or only high school educations) create significantly more in costs for government than they pay in taxes. The figures are all over the place  but generally $100 billion per year. The cost of the border wall would be approximately $25 billion. Hands down  it will pay for itself. I also believe this is somewhat what the president meant when he said that \\\"Mexico will pay for the wall\\\". Instead of American taxpayers bearing the burden of the $100 billion cost of illegal immigration (the majority of which comes from Mexico) each year  the Mexican government will have to foot the bill.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Deporting our work force doesn't make sense. Why spend billions on a wall to keep out people when our economy is so weak is all the wall we need. The only immigrants I know are working like crazy  paying taxes  and contributing to our economy.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" It's so rewarding to have President Trump say publicly how poorly Jerry Brown is doing as governor. Part of California's problem is that nobody says anything. That has to change  I hope President Trump takes a few more swings at him  I live in California and instead of it being a prototype it's the highest taxed state and so many people suffering  Jerry brown now wants it to be a refuge for illegal immigrants some of them very dangerous people. We wouldn't let zoo animals loose but Jerry brown enables people worse than dangerous animals and gives them shelter and medical care. I don't know how he sleeps at night\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Have to love the thought of paying for the wall through recoup funds illegal immigrants have been collecting that they should not be allowed to receive. Go Trump!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I still don't understand how ILLEGAL immigrants get ANY MONEY NOW. Can you think about going to another country illegally and get their money... CRAZY.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Doesn't anyone besides me think these shootings are happening just a little too often? No one besides politicians are that crazy or desperate. These are just political stunts to convince us to give our guns and freedom for safety sake. Don't believe them. Without freedom  there will never be ant safety from law enforcement or the military because they will be enforcing the will of greedy  control-mongering politicians. That won't be good for anyone but the politicians and we see how they're handling the control they already have. Have you had enough of this evil plot yet?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I'm thinking if you all like illegal immigrants sooo much  have a tax donation line on the tax forms for a  real concerned cititizen to donate to their care. Let's see where their heat really is  or is it all talk.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I work at a University and we have campus police. I would carry if they trained me and paid me extra. If you are in a shooting incident wouldn't you rather have a choice to be able to fire back? No one is forcing anyone to carry  it's a choice. If the Broward Coward's had done their jobs  as well as the FBI  they could have stopped this incident.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is all well and good  but the Broward County Sheriff's off office failed it's community long before the shooting by doing nothing about this crazy person for years.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Yes   cut all aid to illegal immigrants   put it towards the wall...in a roundabout way    Mexico would be paying for it....or take all the drug money that you confiscate   and use that.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" 3 school shootings a week   trump offers sincere condolences  I feel desperately sorry for all Americans with this complete buffoon at the helm.. RIP\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Baltimore Mayor Pugh  prosecutors  and the city panel must really love all the murders and high crime rate in there city. Maybe they are afraid they might lose their spot as The nation's highest per capita homicide rate and has been coined the deadliest big city in the United States. What a grand title to be proud of Baltimore City officials!! Maybe your city's populations will boom when the illegals leave other cities to flock to your community! You could change your motto to read That's not paint on our streets it's human blood from our beloved illegal immigrants working to clear our town of legal  decent law abiding citizens ! Thank you for making the rest of our communities safer !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ty President Trump ..I just had to leave Nancy and her protection of DACA ...Americans are hot about that issue of illegal immigrants...Americans have had enough of the lawlessness of the Democratic party and they.are no longer the party working for the Americans.. Nor our children..\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" How is that going to make students feel safe ? if all you gonna do when the shooting starts is stand and get shot with them... \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Thank you for calling them illegal aliens rather than illegal immigrants. Unfortunately I live here in Maryland. It's time for the rest of the counties to sue Baltimore for wasting our tax dollars on this crap.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" So the libtards think by getting rid of a gun the shootings will stop? Lol! Stupid. No common sense. Lets ban cars while we are at it too. For all the DUI'S. It's not the drivers fault for driving drunk right? It's the car isn't it?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" ð  ªð  ¸ I am an illegal alien. No one is sending me back. This crisis began over 50 years ago when pedoohiles began the CIA.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Happens every day with drunk drivers even US citizens. Maybe say something about people drinking and driving. Not once did Trump mention anything about Nassar molesting 100s of kids. Or the recent school shootings cause they were white. Get lost with the BS\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Wealthy people  dignitaries  former presidents  important buildings  etc.... All have armed security! Nobody from the NRA shot you or any kids. Why don't our kids have the proper armed security? Why are you trying to keep students from being protected by armed security? The answer to these shootings is more guns in the right hands. Not disarming people that had nothing to do with the last shooting.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I find it perverse to see that the City of San Francisco cares more about a worthless illegal immigrant than it does a beautiful and talented woman who was a citizen of their community. Sick\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Of course he did it! Most people Knew that when it happened. He is so narcisistic he believes he can admit to it without repercussions  That jury was so tainted they made him get away with murder. Hopefully his children see thru him n learn the truth. But no matter what - he will continue to get his!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Wow  another school shooting. You know children dying is so frequent it hardly makes international news anymore. But of course  you need to be kept safe from Mexicans  remember its Mexicans which are the problem.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Hillary got kind of quiet all of the sudden. Hasn't been shooting her big mouth off like she usually does....\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" America dodged a bullet with Hillary! What a shrieking clown this woman is. The Dems really don't get it  do they? Listen  we hated paying through the nose for Obamacare. We hate when our tax dollars pay for refugees and illegal immigrants. The government destroys everything it touches. Just get out of our lives  please. My cell phone is just $25/month from Tmobile. My auto insurance is also just $25/month from Insurance Panda. Why? Cause the free market works! Take your socialist agendas and shove them where the sun don't shine. Hillary supporters are mad and saying it's Russia's fault for exposing the corruption on Hillary. Anyone else think this is funny?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" And they want us to believe their trash. We all know that what they are fighting for is their own political agenda ! Getting votes for their own party ! They don't care about anyone but themselves  and Illegal immigrants that can carry out their  hidden agenda  Chuck Mr Schumer. Release the memo. Build the wall\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" islam has been illegal in this country for many years  that demon should have been put in prison or exiled to iran 50 yrs ago!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Schumer Shutdown is the kind of crap I have grown to expect from the democrats. But... I have figured out the problem is we have to many democrats still left on the hill. Democrats are making a joke of our country and only care about themselves  Illegal immigrants and obstructing everything. Schumer and his #SchumerShutdown is a disgrace to our country. We need to get  more democrats dethroned this November and that will end this insanity. MAGA Trump 2020 an... #ReleaseTheMemo\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Hillary is famous for shooting on someone else's shoulder.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Normal behavior of the peanut brain trashy racists that are just shooting themselves in the foot as usual. They are the face of their party and it's getting them nowhere. Pretty sad yet a little entertaining. No worries.  \"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" AND WHO WAS THE DARLING IN THE WH? correct! the islamist barry soetoro  aka obama....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Hold your ground POTUS. End DACA  end chain migration  secure our borders. Prosecute illegal immigrants and those that would give them jobs and refuge.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" After seeing Colorado protecting illegal immigrants who murdered someone  I am glad I dont live in that state and further more  cancelled my vacation plans for this year  we were going there but now seems a dangerous state.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Fort Hood shooter was a psychologist. Kind of kills the we need blah blah better mental health or whatever they try to blame shootings on. If a crazy can get in charge of diagnosing crazy  they can fool anyone. Some creeps are just evil :(\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Riddle me this batman: What if the Dems reason for government shutdown is to distract from the memo? The DNC wants that shutdown because then that all that crime will be difficult to know the truth. They are very good at creating crisis to avoid exposure! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" it is beyond the time that this should have properly been reclassified as a radical islamic attack.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Feinstein u want abortion but u and Chuckie Shumer and the Democrats want the illegal immigrants to come in America and have babies at the cost of the poor working taxpayers\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" 25 000 Bond?! Unacceptable! Oh that's right he's an illegal immigrant and because of the democrats he gets special treatment over American citizens! Appalling!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" FBI is involved in the Las Vegas shooting gun running ISIS involved this needs to be investigated by AG Sessions if we can trust him too many lies being told!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" All illegals need to be removed...it is simple...make it a federal felony to aid house or employee any of illegal immigrant regardless of nationality and they will self deport or turn them selves in to be deported...\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" And they wonder why so many people are suspect of the Las Vegas shooting. The FBI has become a cesspool of corruption. There are good agents but they are constantly fighting with the bad ones.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" evaluating the President of the USA..nonsense..I want to personally ask  12 questions about HRC's health and lack of moral character and how many people she suicided..anyone with me? I dont need moron docs to tell me a President is ill...I can see he is doing just marvelous...a little narcisistic like Obummer but they all are in that executive position....docs who think they are gods of your mind are nutcases themselves.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" No wonder killary won California  all the illegal immigrants wack  jobs moon bats   and. Dead people  helped her win the state . How in the hell can you get over 100%\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" He's a criminal illegal immigrant so I'm not understanding why the city thinks he's entitled to due process under the law. The law was created for citizens.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" We hate illegal immigrants. ï¤³. Donald trump president can make usa great again. Dear Trump president. We want wonderful and happy new year event. Strike against North Korea. Preventative war. Annihilate red evil regime of Pyungyang totalitarianism. Kill communists and KIM pig. Give north korean freedom and human right.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" People are sad and pissed off and want to do something  so they pick on things that their limited knowledge allows them to fear: guns  crazy people. Rather than attempt the impossible  to eliminate dangerous things  the obvious solution is simply to take action to defend yourself and your children. We need better defense  no gun free zones  armed defenders in schools and other public places  and things like armor in backpacks. Rather than complain  results-oriented people and governments take action. In Israel there are armed guards in the schools and they have no school shootings. In Europe there are soldiers and military vehicles every few blocks in big cities ready for action. These deterrents work. In America the liberal press would have you believe that complaining works. Not so.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Today's daily dose of outrage dug out of the gutter to keep everyone dumb misguided. PS  illegal immigrants are not ruining this country...but cool story bro! Illegal immigrants didn't run up $20 800 000 000 000 in debt fighting endless wars nor did they give us a newly minted $6 500 000 000 000 deficit courtesy of the budget and temporary tax cuts. Illegal immigrants didn't lose $6 500 000 000 000 in 2015 alone only to get a pay raise in 2018 like the Pentagon. Illegal immigrants didn't drop over 26 000 bombs on 7 different countries in 2016 alone. Illegal immigrants didn't drop a bomb on average of every 20 minutes every single day for 8 straight years like under Obama. Should I go on?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ted . This is a bunch of crap dicks sporting goods and field and stream are stripping there stores of ar-15 . And 21 to buy any firearms . I instruct 4-h shotgun and there dam good kids . What's this gonna tell them it's so sad in today's world that we blame the GUN . Will they take away shooting sports next for those kids .\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Aaron Carnahan just gave the most idiotic comparison of gun ownership and your civil rights to criminal shootings I have ever heard in this lifetime. Join the NRA or risk sounding like him. Don't be an Aaron.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Here  here! And it couldn't hurt to get the mooching Gubment hands out of our pockets paying for these sitting duck shooting galleries. Home schooling allows the parents to have time with THEIR children. Another boost to the economy and a weeding out of the worthless teachers  not to mention the savings in all the Gubment daycare centers on every street corner  and reduction in traffic pollution. These centers could be used for the treatment of the real troublemakers.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Paul the Democrats are pushing for felons and people in prison to vote I hope this gets stopped by the Republicans it's bad enough California is allowing the illegal immigrants to vote\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" ted..ive read allot of comments here..nothing makes sense to me anymore...you or i and even allot of the crazy talkers would take a bullet for a childs life with out question..they cant find all the guns if they try..backround checks are a joke ...but we cant leave kids behind..some are saying they havnt a say when they are being killed .kids cant carry at school..i can defend at my home from any lame brained booger eating moran who wants to threaten my family..as well as on the street..with guns or a brick or i stone knife i flake...but after my kids leave on the bus im not there..i dont trust jimmy's parents anymore then johny's..securing schools is possible..prisons wont let anyone come and shoot a capgun let alone shoot inmates..courthouses.and our police stations when is the last time someone tried shooting kids with cops around..shootings at public events concert's ect..im not sure how but we must protect our performers as well..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Goes to prove there are more gruesome ways to murder people other than shooting them. Are we going to have hatchet and axe free zones now?? ?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Crazy thing is that's what Trump said. He only wanted to deport those whom committed a crime here. Media distorted it and of course ignored the fact Obama deported more illegal immigrants than any other and almost as much as all presidents combined form 1900 on. Shhhh let's not talk about that.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Be careful when you say  you will sign whatever they decide on. Remember..democrats don't care what their constituients want. They only care about votes  taking over the govt again  and forging ahead with obamas agenda..communism! And islamic sharia law. Democrats lie...they took an oath to abide by the constitution  and the next day  they spit on it.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Thank God for Mr. President Trump. You truly know it all about that islamic terrorist akhoond occupiers regime in Iran. Please keep in mind that such misery upon a nation for 39 bloody years was faciliated by mojahedeen e khalgh (mko)  and yaser arafat terrorists. Why is Mc Cain in bed with the mojahedeen e khalgh?? Does he have any knowledge of real history?? In all the heart and support you have for Iranians  Don't support or let anyone plan on mko for Iran. They are hated in Iran more than this regime..\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" One thing ill say i enjoy seeing when my president speaks is the AMERICAN flag behind him. No more of the islamic flag behind Obamanator\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Speaking of hate crimes and thugs and all the other crap that the twist and turn  why is it that none of the major news channels covered that M.L.K. shootings in miami  where atleast 8 innocent children of color were shot by gang members of color... Its because black on black crime isnt sensational news fitting with their agenda..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Oh FFS..the flu is a virus that mutates and can't be eradicated. Let's see Ted  if all the airport ppl had guns I guess no one would have died that day. Or let's see  40 other ppl with guns  panicking and shooting anything that moves for fear that they too are going to be shot. Everyone on here will say  oh I wouldn't panic. Bullshit  natural human reaction will be a rush of adrenaline boosted into your system causing over stimulation. How fucking moronic do you have to be to believe that everyone having guns is the answer. You are a wart on the ass of society and nothing but a washed up shitty musician. Stay in the backwoods where ya belong. 1 year from now you will be uttering the words  wtf did we do . Build your wall  stay the fuck inside of it. No one wants American trump supporters anywhere near them.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Thank you Senator Schumer for the lottery immigration law. How stupid is this??? No vetting  just a gift. OMG  makes no sense. If he wasn't an isis warrior when he came he became one thru his friends and social media. Also  this is not politicizing this horrific crime  it is telling the truth. This was a terrorist that attacked us. Not a citizen of the US but an immigrant. Regarding the Vegas attack  it was a US citizen and to date no terrorism has been found. Two completely different situations and circumstances and two very different evil people. Shame on congress and Schumer for what they have done to our country.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" And now. You know who's shooting up the schools! We need institutions to put these sick people in till they get clean or keep them there if they don't. What if the voices told her to gouge out  some one  else's eyes!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The islamic plague needs eliminated in our country ASAP. Let the rest of the world deal with it if they want but it does not work with our form of government and never will as long as they use the Koran... no matter how many lies they try to tell the world.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" WEll....  to some of us in this country we care about immigrants. Im a democrat. I care about immigrants. I think of the issues. This post is a clear ploy to fuel the Left vs Right fire.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" My Aunt was pissed because    a governor of some state wants everyone to carry a gun . She said that is nuts ! I said duh all shootings are in gun free zones  I said I didn't think that is a bad idea . She thought I was nuts ! Just maybe we could protect ourselves . Narrow minded people   I swear\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Popular vote lost destroy isis in the first 90 days faild casino faild collage faild vodka line faild clothing line faild 2 failed marriges several bankruptcy over turn Obama care faild build the wall faild mexico will pay for it faild drain the swamp (rotflmao) the only people he has fired are the ones he has hired ( that is a special kind of stupid right there ) so with a republican controlled house and senate he cant even get his own party on board with his lunacy! !!!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Yep that's what we said all along dems are so out of touch they are loosing vote in large numbers due to clinton Feinstein Schumer schiff warren and a whole lot more so they see immigrants as a way of getting their numbers up they don't care about anyone but themselves look at hillary she thought she was all that and thought she had the election handed to her surprise she lost\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Ted it's  a complex mess. There is no fear of God anymore especially among the young people young parents allow their young people to play violent video games instead of going outside and learning and discovering nature our government wants to help illegal immigrants refugees and terrorists instead of worrying about our children many teachers try but many of them just do not care drugs are taking over because our government ran by idiots like Obama Will Not Waste a dime to help the police and Sheriff's departments fight against the drugs they would rather help illegal immigrants and terrorist Nations and help our own country if you ever make it to Ohio look me up we need to sit down ground a few worms and think about the things that could help America it wouldn't hurt I'm just a small-town hayseed but if the government would listen to regular with people a little more often things would get better you have a cool day sir\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" WHat you see today is An  'M1 Abrams' tank from USA army to iraqi army to defeat ISIS but Iraqi army is using them  against Kurds  \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" You Democrats you're not burning anybody's mine everybody knows the only reason you want immigrants in this country is for the votes not everybody as dumbest you are\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" All Hollywood celebrities have made pack with the DEVIL! Whoever support Christianity becomes a target! Obama was immoral always bashing christian values and yet he had all the Hollywood crowd and satan churches supporting him! Why celebrities never criticize islam? ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Support Israel? Don't support Israel? What are Trump/Teds views today? Are white suppremisist supposed to be for Israel? Or like the KKK  be against it? Please Ted lead us in the right direction  too much fake news\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" What's funny is that most immigrants are Catholic  they believe in the same Sanctity of Life as Republicans  yet Republican's racism pushes these people to Democrats.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Closing the barn door after the cow has left. Too little too late. Those islamic terror cultists in Iran already have nuclear capabilities. Clinton's incompetence in Korea will cause the annihilation of North Korea and the traitor Obama's acts will insure the annihilation of Iran. Good riddance to bad rubbish when it comes to those two nation states.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" These idiots there wasn't a shooting there. But good try asshats!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" What about domestic terrorists? I dont know about you but ive never met an islamic terrorist. I have met plenty of racists however...\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Illegal immigrants are law breakers in the very sense of being illegal. How in the HELL can they VOTE in any citizen based election?!?!?!?! ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They are on George  Soros's  pay roll one of his shell groups they  don't  do that for free. We should  put a 500$ bounty on their heads and a week later you wouldn't find one in Oregon. I have spent time there it is filled with skinny toothless meth heads. Just a large number of subhuman rifraf. They are on the government  dole and either smoking meth or shooting dope but they contribute nothing to our country. It is sad to see so much waste on one place. Portland is one sick place where the unwanted youth go to die slowly. I have been around all over and Portland has got to be one of the worse in the country. I would have to take into places in the third world to beat it.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Republicans should stop using immigrants  legal or illegal  as an alibi  for lack of performance and poor planning.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Really you want to criticize sanctuary cities with made up lies about immigrants. But the kkk and white nationalist can kill people on TV and your like they weren't all bad people. Your such a pos.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Shove this islam minority bull up your skirt.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They vote to bring in more immigrants \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Donald Duck  you are a mad  narcisist who is a danger to all the world. You don't know or care about your country  just about making as much money out of this incredibly sad situation of being the so-called POTUS. So glad I'm not American. The rest of the world is laughing at you ...and crying at the same time. God save the world because you are destroying it!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" When I see stuff about the death cult islam it infuriates me cuz there are so many ppl in this world who have turned and are turning a blind eye to the truth of what islam is....it is not a religion of peace it is a cult....where politics governs it....like scientology...\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Omg people she was totally disrespectful having sex in her mother's house. Oh don't hit these poor entitled babies. You'll hurt them. Look where coddling these kids have gotten us. School shootings. Smack the crap out of her.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Trump  Sessions  Bannon   neo nazis  white supremacists  etc are all immigrants and should go back to where they came from! Across the ocean!!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" All the people trying to push these laws and get the bans on all the bump stocms etc are all protected by ARMED Security. Gun laws and bans only hurt the good guys. Law breakers will always figure out how to get guns  ammo and accessories as they dont follow the laws now. How the hell is any of this going to stop shootings. Schools need security. Gun free zones need to go away. At all these shootings if one person shot back it would have gone down way differant.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Please she most certainly is backtracking trying to save her job. ANYONE who would consider the shooter a martyr and has no feelings of sadness for the officers that were killed in this mass shooting is a disgusting person. One I would not ever want to personally know. I hope she loses her job for good.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Sanctuary cities  as you have labeled them  keep streets safer for minorities. When immigrants fear deportation  they don't report crimes; they don't report fires; they don't seek out police help. When that happens  these immigrants become an easy target for criminal acts of all kinds. If a fire breaks out  immigrants can call the fire department without fear of the police deporting them. When someone robs an immigrant  that immigrant can call the police to report an actual crime to the police so that the police can work to stop the actual criminal. This is the purpose of sanctuary cities. If an immigrant commits a felony  they are not afforded protection. Immigration violations are not criminal violations - they are civil violations. Either stop treating immigrants as criminals  or start giving them mandatory access to lawyers who can aid them like we do with criminal defendants.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Stupid democrats don't get it if all carried and had a gun in their home people would think twice about messing with people or their homes and property. Teachers with guns would keep nuts from shooting in their schools.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Family friend Madison Davey spoke with Jason Sheats after the shooting  she told ABC13. He told Christy  'Just shoot yourself. Make it easy on all of us  just shoot yourself ' and she said  'No  that's not what this is about  this is about punishing you ' Davey said. #pureevil\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" MAGA = Morons Are Governing America \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" There is absolutely no way trump could could lead this country out of the financial crisis of 2008 that Obama inherited. the trump administration cannot get out of its own way with all of the scandals and turnover. Once trump is done its this county in 4 years it I'll be a mess. 1.5 trillion dollars has already me added to the national debt so the rich can be richer.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Shame on Dr. Drew for still peddling the idiotic terrorist line. It is obvious CNN-Time Warner is way in the tank for Donald Trump  and this is why they peddled this terrorism nonsense from the moment this tragedy occurred without ANY evidence whatsoever. The network clearly has a candidate they want elected  and they will do everything possible to see that it happens  whether it is fabricating a terrorist plot in a mass shooting that is not unlike what Elliot Rodger did two years ago or giving him free air time 24/7 at the expense of all other candidates. Completely and totally despicable. I had to shut the television off when Dr. Drew was peddling the terrorist line and claiming that no way was Mateen a gay man.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" We are all immigrants on Earth. Humans made boarders not God Israel. This Earth belong to all of us  We all have got the right to stay where we want to. There must be order but not against God Israel's laws and covenant. Everyone also has the same right to anything on Earth not only these governments pigs murderers who kill kids and people to stay in power and war. The only nation that has been give boarder was the israelites by God Israel himself. The reason there  was to lead the Earth in His laws and covenant. Humans made their own corrupt laws! Government's call people terrorist it id because of this. They are also terrorist. Proof me wrong!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Carson will never resign voluntarily for ties to Farrakhan. He's an islamist  too... http://www.discoverthenetworks.org/individualProfile.asp?indid=2552\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" What have you against immigrants? We are a country of immigrants. Your parents were immigrants. Your wife came here illegally. You are a hypocrite and a liar. You are not fit for office  and are a shame to the intelligent  non-religiously biased citizens of America.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" do you want this to keep happening? You all need to open eyes REAL ISLAM. This article explains how Killing homosexuals is encouraged in Islam not just ISIS. OBAMA IS LIAR. 1400 YEARS of Muslim invasions  INTOLERANCE  HATE  SLAVE TRADING  OPPRESSION WOMEN CHILDREN. His brother is muslims. His cabinet advisors are Muslim Brotherhood. google Holy land foundation trial how muslim brotherhood tried take over US. http://www.nationalreview.com/article/436505/mass-shooting-florida-anti-gay-violence-rooted-muslim-law\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Get rid of islamberg. Get rid of the new somali muuslims who have invaded TN. MI And MN are a mess. Get these muuslims out of our country. They want to kill us. I don't feel America is SAFE at all. You can do it Mr. Trump. Please address the muuslim situation in our country. 1952 law states no muslims can come here let alone be in Government and teach in schools and be judges for heavens sake. Why hasn't this been addressed yet? Are we just going to keep letting them invade America? SHELBY TN. New invasions making the citizens who live there bow down. Come on. Sessions needs to do something here.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Btw idiot  Get facts strait  this was not again NOT deadliest mass shooting in US HISTORY. If you idiots in the media knew your history your GOV did the deadliest mass shooting to a Indian tribe many years ago\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Why am I not suprised. This is the same type of racism practiced by white supremecist but its under the guise of ethno-centrisism.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Just so you're aware that HIV is more prevalent in illegal drug users from sharing needles. You know like heroin. That crisis that Obama did nothing about to stop it.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" isis is islam. stop pretending it is not. KKK are christians. we are having the wrong conversations  mostly because of our government and the media. we need to talk about the value of human life  the value of women and children. if you wear an hijab i see nothing but subjugation  and sharia. both of those are completely incompatible with western freedom\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" MS13 was welcomed here by Obummer and team  because they are Illegal immigrants  these are the criminals that Obummer and liberals want to come here  they are not concerned with them murdering kids. How the hell do these people's minds work? Certainly not like mine.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If i recall  Wisconsin has a large Somali immigrant population  perhaps they are contributing to the problem? Males in their culture do not believe in comdoms.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" There are currently 15 000+Transgender  in the Military  I appreciate their brave service. This is how hate works-----you start with the smallest and weakest group of people because they can't fight back and nobody cares about them enough to fight for them. And then you go on to the next group  muslim immigrants because they are all terrorists. And then Mexican immigrants because they are all drug dealers and gang bangers. And then you move on to gay people because they are degenerates. Then you go after jews and atheists because they are un-American heretics. Then you attack black people because they aren't like us and they are all lazy criminals and welfare queens. You keep going and going and going until all you have left are white  blonde  blue-eyed people who worship God  Guns and Gold.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" No I think the guy's mother taking a crazy person shooting was the cause. God Bless all those killed..\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" For once  I find myself in partial agreement with the buffoon in office. Repeat offenders should face harsher punishments. However  the second bill is an affront to justice. It basically allows the police to hold suspected illegal immigrants in prison for as long as they wish without bail or trial. And that  my friends  is a great and terrible wrong.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" What does any of this have to do with protecting kids at schools? Every single shooting has been committed in violation of many  many established law. This is merely an ignorant Democrat show that will have no effect whatsoever.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" These politicians and the entire state of Florida knows what and why that school shooting happened. The kids of color are protected and not arrested so that they will have a chance at getting a job and going to college. The FBI  Broward County Sheriff Israel and Deputies  and the corrupt politicians of Florida along with Obama and Eric Holder who helped implement this policy all have the blood on their hands and instead of putting the blame on the real problem and halting the policy  they want to blame the gun !! So ABSOLUTELY NOTHING got accomplished and the school; children are still at risk ! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Waste tax payers money on illegal immigrants why not a parade 100% support this Trump please do it the liberals will go more crazy please do it America needs it\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Terrorizing innocent immigrant families? She said this? Legal innocent immigrant families aren't terrorized! There is no such thing as an innocent illegal immigrant family. I hope Sessions and Trump bring down the law on these weasels and their disrespect for our laws  our Constitution  common sense and the citizens of California who are goddamn fed up with this crap. Jerry Brown should be behind bars. What an A-hole.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" People blaming Trump when I believe we had shootings and bombings during Obama. Guns are not getting banned okay and even if they were they can be made homemade. Trust me some people got their hands on some nice 3D printers.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Just my opinion  but most of these shooting have been orchestrated to look as random shooting when in fact they are all related. Nothing but smoke screens and agenda pushing all financed by the Clintons  Obamas and yes  Soros all trying to push their socialist agenda on the American people. Whatever happened to the investigation of the Las Vegas shooting? They are being too quiet if you ask me  and I know you didn't ask. Look for the common thread that ties them together and you will see who is holding the thread.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This is not surprising and he meant every word he said. People who don't like what Trump is saying or rejects his crazy behavior should stop doing business with his companies. Stop staying at his hotels! Stop playing on his golf courses! Stop spending your money to make him richer! And for all those immigrants who work for him  you should walk out of those positions  and see what he does. He's a total disgrace! ð ¤¬ð ¡ð ¡\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" what a coincidence that the very next shooting is from a veteran after the School shootings reached it peak. SMH now we veterans will be demonized again\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" With the investigators focusing in on the DNC and Hillary financing the Steele dossier (Russian collusion)  and  Comey having already said it was all salacious and unsubstantiated (lies)  and then the Uranium One fiasco coming to light with it's Russian collusion and huge payoff to the Clintons  the school shooting was just the type of tragedy the Dems needed for cover and distraction...you remember  'never let a tragedy go to waste'.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is not surprising and Trump meant every nasty  disgusting word he said. People who don't like what Trump is saying or rejects his crazy behavior should stop doing business with his companies! Stop staying at his hotels! Stop playing on his golf courses! Stop spending your money to make him richer! If you care so much about having a positive impact on humanity. And for all those immigrants who work for him  you should walk out of those positions  and see what he does. He needs you more than you need him. He is not worthy of you loyalty and sacrifices! He is a total disgrace! ð ¤¬ð ¡ð ¡ #NOTMYPRESIDANT\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The U.S. government is not responsible for keeping up with their family members. They came here illegally  they get to go to whatever detention center they're sent to. After that  we want them all to go back.....together....with each other. It's simple really! P.S. they're not immigrants  they're illegal aliens!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" the FBI was too busy covering up crimes for Obama and Clinton they could care less about this school shooting they could have stopped it and they did nothing....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Why is it that the only time we need policy change is when the terrorist is an immigrant? Where was the outcry when a crazy #whiteterrorist fired into a crowd in Vegas? How did he get so many guns in our country.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" What is it going to take to stop this illegal immigrant problem. There is not one country in the world that tolerates it. I hear so many foreigners say   only in America. Now the ACLU is claiming they're looking for political  asylum? I say bullcrap.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" fbi knew and used this kid as a manchurian candidate  like others in republican shooting las vegas church navy yard va.tech  and more ..they knew  part of deep state=communism in our government along with radical muslim s\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Mike Pence just crossed the line on this stunt and definitely without a doubt added himself to Trumps craziness wagon! You know what  this has become bigger than one race in this country! It is about us all and our rights! And if we keep standing and don't take a knee eventually  anyone will be in the crosshairs of these crazy people and their antics! The shooting in Vegas shows nobody is safe from this craziness. Nobody! Take a knee! Even if you do it with a small flag in your hand. Take a knee to say 'wrong' can not be a right for any people of our nation!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" How can the aclu even be involved? the so called immigrants aren't legal American citizens and there for have no rights to the civil liberties guaranteed to legal American citizens.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Excellent opening again Judge  I especially love your comment \\\"why should we have to work to pay for them\\\". Both of my grandparents came to this country from Italy  their names were changed because it was too Italian. They worked hard  my grandmother worked in a sweat shop sewing 10+ hours a day. What the Dems want is an insult to all of our immigrant ancestors  who by the way  got nothing handed to them or for free! P.S. Nancy Pelosi needs to retire  I can't stand looking at her  is she for real?? Love you  love you show!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I'm sick to my stomach! !geraldo just made a comment that undocumented immigrants are the ones that are building our country!! Our you crazy!!! They all need to be deported.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If illegal immigrants are such outstanding people why are criminals being hidden by them? How about ICE setting up hot lines for illegals to call and report these criminals and give rewards for those caught? If the illegal reporting has no criminal past the government could reward them with a path way to citizenship.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If government police obviously failed to detect before and ran away while shooting happened  then self armed citizens militia comes forward. Vet did what he could. At list he is trying. The rest of you  spineless    doing nothing   but barking at him from your safe spaces\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" i can't believe there are so many here that are unbelievers in the Word of God. Jerusalen is the only city in the world that God has ever claimed as HIS city. israel has given the world far far more nobel prize winners than any other country. they have to protect themselves from the crazy islamic lunatics..and by the way  if you study hisstory  really study  you will find that the palestinians are just a bunch of arabs and various other mingled races that chose to camp out where they are now. God set israel's borders and those borders are a lot bigger than the present ones\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If he didnt tbink shooting was happening why was the coward not going inside to help? Pos. Fire his azz! Criminal AND COWARD!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The cops and the fbi should have stopped this  it's all about taking away all of our constitutional rights  when a democratic rifle shooting idiot shot at Republican softball game no one cried take away everyone's guns.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" The shooting was over folks   they abandoned their jobs in the middle of the workday so they could rubberneck and tell all their buddies they were at the scene  what friggin yahoos. I love how you rubes just start spouting your authoritarian  wanna be hero nonsense before you even understand the facts laid out in the article. Sad. :(\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" His slippery azz double talk excuse sounds like islam speak to me! Sorry police are normally there to rush in whatever it takes to save lives! Not hide outside and now talk gobbledy goop bs to excuse his cowardly behavior! Maybe he didnt go in because they were non muslims. I have a strong belief he is a convert! https://counterjihadreport.com/2016/01/23/mosque-with-ties-to-palestinian-jihad-gets-gun-training/\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I am sick of all the lies from Killary and Obama....who permitted to have illegal immigrants to come to our country? It is Obummer! Killary will be next to welcome immigrants.....they do not think of Americans and their needings. Fk them...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" There are many liberals pointing fingers at the NRA and weapons as the fault of the Florida school shooting . But the NRA did not stand around and let those kids be slaughtered or suspend two officers who tried to help . The liberals should be pointing their fingers at the disgraceful police department that let this whole tragedy happen . These two police departments   not the NRA   are to blame for the murder of these 17 kids .\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" His LOYALTY is to islam NOT TO OUR CONSTITUTIONAL REPUBLIC \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Obama and Hillary refuse to acknowledge and address that America is at war with islam terrorist but that does not change the fact that islama terrorist are at war with America. They cannot protect nor defend the lives of Americans until they reconize and firmly address who the enemy is first. The enemy is not knocking on our door they are already in our lands killing Americans and that enemy is islam terrorist. It is not guns  knives  pressure cookers bombs  airplanes used as flying bombs  axes  etc... those are only the weapons of choice used by muslim terrorist. The threat to Americans and America are muslims terrorist who will use any and all weapons to destroy our lives  our freedoms  and our futures as a country. This is the issue at hand. This is the threats at hand. But obama and hillary keep side tracking to protect muslims instead of Americans to other topics because they are loyal and protective of muslims obviously not Americans.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" life in prison  maybe his jail cell should be the back end of a truck with no water or air or light....ughhh...and you people think we don't need a wall. This isn't only for the safety of the American people but also of the immigrants trying to come here.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Starting in the USA too......Rep. Keith Ellison (Democrat ..Muslim -MN)  the new deputy chairman of the Democratic National Committee  and the first Muslim elected to Congress  has a plan to recruit additional Muslim lawmakers like him -- including possible candidates sponsored by a terror-tied Islamist group for which he helped raise millions of dollars  according to a source who once prayed alongside him in the basement of the Capitol....https://www.frontpagemag.com/fpm/265978/new-dnc-deputy-keith-ellisons-islamic-agenda-paul-sperry\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Why no. Rodent-Clinton and her horde of islamo-Whacko jihadis are chomping at the to get in to the Pentagon. All those islamo-Whackos will get Ultra-Super-Dooper-Crypto-Top Secret clearances and a free de-coder ring out of a Cracker Jacks box.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" damn crazy even after its confirmed he's a crisis actor and videos and  stories getting erased off the internet and the mainstream just ignored it and pretend like he's not amazing deby deny deny just show how brainwashed regular Americans are control the media and you'll control the mass...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Just another angry leftist that shouldn't be allowed to own guns after this so he doesn't go on a mass shooting spree like leftists like to do..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Melonhead  back off the shooting victims. The rest of the country is getting pretty fucking fed up with it.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Coward attacks from behind  just as cowardly as a mass shooting.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" islam is a ideology  not a religion and there is NO  peace involved in it. Women have no rights or say about anything  they are treated worse than cattle. Children are raped on a daily basis and anyone who says anything against islam is put to death. That is NOT peaceful. The bible was written long ago also and we have evolved while keeping the spirit of it alive. when the stinking mussies can do that  then maybe we could listen to some of their ideas. Until then  they need to be removed from civilized people.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Awesome! People that call the Florida school shooting and Sandy Hook \\\"false flags\\\" don't deserve \\\"free speech\\\". They are Un-American  sub human pieces of sh!t.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I agree with Dana  in order to reform islam you would first have to get rid of abrogation. I do not have the figures  but if you are going to remove all the hate  kill versus you probably would not be left with much. The short time before the pedophile turned on the Jews is the only time he was not killing  enslaving  raping people. Better off just doing away with the hate cult just like we have with the kkk. They will still be around but they garner no respect.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Want to stop unhinged 'progressives' from shooting up schools  fix the declining family unit and home.....Liberalism breeds this kind of monster.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Las Vegas and Florida shootings are both 100% one of those cases where the police can't tell everything they know  because it's still being investigated  which means speculation by the public  like whether there was more than one shooter  is fair game. You Tube and Google need to stop listening to the Pussy Liberals sensitive feelings  and let the public seek the truth.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" All you f****** morons are doing is giving CAIR and the islamists everything they need to tell Muslims  especially young Muslims  that they are hated and they should join them to fight against people like you: Shallow morons.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They were advocating before the shooting. The Sheriff was in cohoots  with Hillary.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I swear this is all organized and paid by liberals and far lefties  all of a sudden we have now major shooting every week  and this is all done to disarm law abiding citizens ð ¡\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Many people postings on twitter  facebook and youtube are being censored if they have posting about Crisis actors??? Freedom of speech is only protected when people say that Rev Graham is in Hell??? WTF.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" You gun rats think he did wrong??? I think he did the right thing. We have to stop thinking that owning a gun will solve everything. It won't. It just leads to more trouble. Not just school shootings but teens killing other teens  couples shooting each other. It has to stoop somewhere.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" YEAH RIGHT!!!!!!!!!!!!!!!! islam  IS EVIL... A religion of satan.... and mohammed a prophet of satans.... Our Lord is coming back to Fight him.. The false prophet is the pope.. He has already welcomed islam into the church.... The day of the Lord is near are we ready ??? ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" CNN is a liberal globalist fake media organization which is totally funded by and controlled by liberals and the DNC. They will not tell you the truth about the Parkland  Fl shooting. There is a big cover up going on. ONe student says she was fleeing the school with N. Cruz and the shooting was going on. Also there was about 10 sheriff deputies and broward police outside the school as the shooting was going on. Why didn't they go inside?? Why is Hillary Clinton in a picture with the Sheriff and how  come broward county gets loads of money. Why did the FBI just ignore the warnings from students. Why. Think about it. Other students reported they heard several shooters  not just one. No one saw Cruz shoot anyone. Why Why Why. Fake News  Conspiracy ?? Who knows  some people know but where are they. If you want to see the students reporting on the what was really going on  go to infowars.com its all on video. Seek the truth   MSM will not tell you.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" It is NOT a religion of peace it is a religion based on conquest and submission. In order for islam to actually become peaceful moslems would have to reject muhamaads words or ONLY use the peaceful passages. Their are clerics who attempt to do just that. And  I ask why? Instead of recreating something good from evil  why not renounce and find something else? What do you tell immigrants? You are free to practice your religion except you are not allowed to spread it by force. Why wouldn't that work?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" So a Sketchy school shooting where the public KNOWS was bullcrap was enough to take the guns....... All the Dems need is a hamdful of liberals to be for it and I guess thats all they need to justify it.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" He's being kicked off of YouTube for saying that the Parkland shooting was a deep state operation. He's being kicked off for saying that survivors of the shooting are actors and perpetuating that insane lie. You can say that stuff if you're a crazy loner  but if you are claiming to be a reputable news agency to millions of people  then you cannot spread baseless lies.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Gun violence would drop by 90% if democrats would stop shooting people!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Republicans drop bomb on Democrats....Democrats stage some sort of distraction (terrorist attack  school shooting NK  threat...etc...)  rinse and repeat....its like a the comic Spy vs Spy....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" islam means submission to to the will of allah  as defined by evil imams  ayatollahs  and Qur'anic scholars. moderate islam is a fabrication of the progg morons in the west to make islam more palatable to impressionable idiots ..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So we have a crazy whose crazy was reported and repeatedly ignored  students who in the aftermath of the shooting are already in a movement funded by rich elite liberals  deputies who were told to stand down (ala' the Bengazi situation) and now the metal detectors were not used. Sounds like some powerful liberals are going all out to force a ban on guns. It would be no surprise if this is the Democrats own Reichtag event.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" When were either of twits ever near a shooting? I know they wouldn't be whispering anything other than   dude  I just shit my pants. Owen Shryer great acting. You look so authentic.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" islam is an ideology right out of the 7th Century...it began with a psychopath named mohammed and this same sick belief system continues to attract psychos everywhere !!! Death to islam..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Time to ban your show cause your shooting truth bullets all over the Left!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" LMFAO! Illegal immigrants for cheap labor and now they're wanting to continue with cheap imported foreign steel to run the mill  where I would bet btw  most of the employees are said illegal \"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ok. The Congress and the American people already know it. But  what about the Muslims shooting and bombing non-Muslims in our soil and in Europe? It is hard to understand and accept that Muslims endorse freedom of speech  religious pluralism and reject caliphate by acting as murderers and terrorists everywhere. The other point to support this speech as untrue and unreal is that even in their place  they are divided and keep killing each other as the Shia and the Sunni. US and Western countries should stop Muslim and Islam coming to the non-Muslim countries.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" IFOXwars certainly isn't one sided !! Once he goes through the basics  Alex attacks the survivors  And the families..On EVERY mass shooting..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" 2K illegal guns cross the Mexican border daily. People who are calling for gun confiscation are also calling for open borders. If you look at where these shootings took place  most  if not all  were in Democratic districts. Think about that...\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I have often asked the question (without receiving an acceptable answer)  how can you have a prophet like mohammed and be a peaceful anything  much less a religion?! wouldn't doing this get you killed in islam today? what is islam without the prophet?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Ok. I'm not a well behaved quiet young woman  Milo. Don't start none and there won't be none  but what you are saying is extremist  it's sexist  and it's crap. The only thing I agree with is the SSRI's are harmful and causing these mass shootings.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Why make owning a gun at 18 a law or under age drinking or having to have a license to drive a law. When we welcome  give money and support and fight for people that into our country by breaking the laws. Key word illegal immigrants and want to let them vote.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The very idea that islam can coexist with our Constitution is false  no it in fact demands it's removal from a peaceful society...which should be done ASAP.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Just like will smith said libs and dems need to cleanse trump supporters from America and then we have this Florida school shootings....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Hahaahah Republictards use the immigrants to globalised their agenda but you are innocent of such involvement hahahaha\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" because you morons Isis uses these videos as recruitment it is also full of lies Jihahd does not mean to war against non muslims  maybe if you all studied islam you would understand\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I can't read this stuff anymore   Trump isn't stopping immigration  he's pushing for immigrants to be legal -- what's wrong with ppl? :o\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" FBI wastes millions chasing biggest fake story ever! FBI ignores legit info on mass shooting? Special of kind of stupid or freakin horribly corrupt? You choose!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" One of islam biggest enemies  the TRUTH..............what has islam ever done for america or what non islamic country has EVER benefited from hosting an islamic invasion as we are seeing in many non islamic countries today?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" California needs illegal immigrants. If they lose illegals in their next census  they'll lose Federal dollars  representatives in the House  and votes in the Electoral College.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Another shooting and more of the same shit reporting WTF are we supposed to believe\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" NEVER GIVE MUSLUMS AN INCH  BECAUSE THEY WILL KILL YOU ANYWAY! Islam IS NOT a RELIGION! Islam IS a CULT OF DEATH at best  AND a POLITICAL IDEOLOGY at worst! Muslums DO NOT assimilate and in their cult  pedophilia  sex slaves  and beating and stoning women is LEGAL! Their CULT demands that they CONQUER non-believers and destroy them via: beheading  hanging  shooting  stoning  lowering their victims into pits of nitric acid  etc.! Muslums are savages and barbarians stuck in the fifth century! Sharia Law is NOT compatible with the US Constitution and Bill of Rights!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ain't that the same bitch from all those other school shootings? ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" WTF are they doing by censoring this they are helping isis and their jihad against us.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" You idiots will push anything to make immigrants look scary  especially black  brown  and Muslim ones.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Playing politics with immigration? No sweetheart that's called the LAW when u hide illegal immigrants from federal agents!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Only immigrants commit crimes!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Coming from the state with high crime related to illegal immigrants  raging poverty  and just about everyone with their heads up their... Ya the rest of the country would be just fine if California just floats right away.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Koran tells all Muslims to lie to infidels so they can gain favor until they can kill them. http://www.muslimfact.com/bm/terror-in-the-name-of-islam/islam-permits-lying-to-deceive-unbelievers-and-bri.shtml\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So deporting illegal immigrant criminals isn't public safety? I'm beyond confused. And if California is the future we're beyond doomed!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" https://www.yahoo.com/news/live-updates-shooting-high-school-parkland-fla-multiple-injuries-reported-200936418.html  but you wont hear alex report on it because it not a brown skinned muslim. we need striter gun control/laws and background checks. this isnt anti 2nd  this is fact. this happens too often by crazy whites.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Disgusting that YouTube would censor the film Counter Jihad. In so doing  they have subverted free speech  the 1st amendment and our Constitution. Furthermore  they have cooperated with the Muslim Brotherhood's civilization jihad which uses the bogus tactics of hate speech and islamophobe. They've taken a stand against individual rights and liberty and allied their organization with the subversive agenda of the muslim jihadists to spread compliance with their sharia.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Islam has no place in America. The sooner we purge our country of all of islams beliefs and customs the better. They come to America to conquer and not to be a part of America.. Once they have taken our country there will never be a chance to regain it. . Anyone that supports this type of culture needs to be gotten rid of. . The terroists are only a small part of what the muslims plans are. If everything American offends them then why do they come here ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" wow this woman is being paid by citizens of California....yet works for illegal immigrants that don't pay her salary\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Someone should throw his islamic ass out a 20th floor window\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" It is like having a king cobra snake as a pet when you least expect it and it will bite you. Do not fall for this fake video. The Koran plainly tells them all to do such evil as is being done by Isis and all islam's. It's like a Satanist saying and they love Jesus but yet there a Satanist water and oil does not mix you either are or are not. I personally do not trust them at all\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop playing politics? Are you kidding me? The only reason the Democrats care about illegal immigrants is because they know they'll vote Democrat. They are the ones playing politics! About 15-20 years ago Dems and Republicans both wanted Immigration Reform. The Democrats were the ones who started the idea of building a wall along the southern border!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Mno pet dogs in islam\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I'm sure obama and hillary will like their new pledge of allegiance; ...> 'I pledge allegiance to the corruption of the banana republic of america and to the politics for which it deceives  one nation without God  in division  without liberties or justice for anyone.' If she is elected...it won't be long before it becomes...'I pledge allegiance to the corruption of the banana republic of american islam...'\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Meanwhile California allowed an illegal immigrant to go free after they killed a women....Please California  secede from the union and try to be your own socialist state. Please go away.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" They aren't immigrant cities they are ILLEGAL cities filled with criminals! Maybe this Senator should start worrying about the citizens that live in California!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ban islam close all mosques.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop the islamic threat in America! Stop letting them in! Deport the remaining threat\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Lmao! The stupid cuckery from alec jones knows no bounds. Now it's CIA mind control. Previously jones said the guy was antifa  then he was isis  then he was a new muslim convert and a patsy. Tinfoil hat CUCKERY!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I live here in CA I don't want to pay for illegal immigrants anymore  I don't care who is President   come here legally  end of story! Give people the opportunity to remain here also the right way! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Interesting in that a short time ago the word Islamophobia did not exist. The islamists and their enablers began throwing this out as a defensive measure when they realized the successes to be gained by labeling critics. Don't accept that? Then look at the use of just two words- racist and homophobic. Nothing good about islam  nothing.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" And they wonder why kids go crazy and violent and start shooting up schools. The liberals push and promote violence. There has not been a conservative rally or protest that became violent in recent history. Whenever there's violence  you can guarantee the Democrats and the left will be there! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Excuse me but isn't getting illegal immigrants who have committed crimes off our streets and either jailed or deported part of securing our country?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" The fifth colomn in America is getting bigger by the day  aided by liberal ans minority useful idiots! This folks are well advised to take a dip into islam's history  useful idiots! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Time for accountability to these liberal leftists democrats. They are lying and spreading fear among the people. These people who are here illegally and have already committed violence and crimes in California. I.C.E. is currently going after crimmals who have records not all illegal immigrants. These liberal leftists democrats and the msm have blood on their hands!! They  can't even get a budget for their districts and are close to bankruptcy!!! Time to get them out of office.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" California leaders should want to protect its legal US Citizens and legal residents from illegal foreign criminal activity! Instead they support and abet this criminal behavior from illegal immigrants! The system is totally backwards.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Get em Ted! Obama's muslim sympathizer appointee's  let's hope we cam clean this scum out when the islam administration is out of office.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" People should be responsible for what they advertise. Who is the cause of all the crazy shootings? There should be punishment for telling the public that we need evil.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Since the Democrats in Congress will not agree to help DACA members  then they are all subject to deportation. Past presidents ignored the law  Obama made it a crisis  Trump forced Congress to clean up their mess and they failed. Vote Dem out 2018!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" So WHY post it? We already Know they're Sick People    tho  for the islam holiday  America should CELEBRATE with PORK! Pork Bacon Saussage    half price.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I missed the news report where ICE agents are carrying people to the gas chambers and burying people in ditches after shooting them in the head. Come on libtards quit lying to prove your crazy opinions.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Costs of living in California would make cheap labor a necessity. My goodness  how would those elite folks who can afford to live there ever get people to take care of their needs everyday? Taking advantage of undocumented immigrants to do the hard work for little to nothing sure makes sense to them. Who cares if the ones who are criminals stay too? Why the one surely outweighs the other! Criminals need to go home where they can do what they do best!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I thought thanking the dreamers parents was just flat treasonous  stop encouraging criminal illegal immigrants. Seems it's illegals before Americans with these crazy dems so much for their oath to the citizens. Cast your votes  wisely\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" but obama says there's no such thing as radical islam! did he LIE?? ?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" For all of you who think Trump is losing it  I suggest you read his book. This is classic Trump. take Schumer and his sniveling about well there are people with mental illness that aren't a danger to anyone and we have to consider them. Anyone read into that what that really means? So if you pass the litmus test for I am so crazy I shouldn't have a gun  but it's a harmless illness  then I don't go on the list is just as crazy. I'm thinking he's looking at the depression crowd. By the way these are the guys that jump the bar into mass shootings. What a maroon Chucky is\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So here we have a (maybe) illegal immigrant from Hungary to Britain  who was part of the David Cameron Conservative Party  espousing on California Democrats??? And he's supposed to have any credence? Fox is sure scraping the bottom of the barrel when they came up with this dude.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" That's what all this Muslim refugee into non Muslim countries is all about. TAKE OVER. The UN is a Muslim controlled entity. Those supporting globalism under a one world government are moving to islamitization of the world and the pope is trying to move the Christian world into a one world religion under Islam. It time to get the UN out of the US and pull all US funding.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Fox News....please bring U.S. born American California citizens on your shows who oppose what's happening in CA due to illegal immigrants. Are there any left? Or are they afraid?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Past immigrants did not have that taxpayer support. And learned English and blended into American culture. Now  we bend over backwards with our tax $. Sucks!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Islam dirty religion and sharia the law of the devil and islam and qoraan should be outlawed in all civilized countries this os not a religion this is evil ideology should be destroyed\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Californians are fed up. Steve Hilton was on target. When a state can tell its citizens (me)  they will be jailed if they report an illegal immigrant  The federal Government needs to jail the California State Employees who made and plan to enforce such NAZISM.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Give no money or services to legal and illegal immigrants\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Remember isis is the jv team they are contained Obama word\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" SO...any of you Foxtards even know this guy?? ?....its ok  he's another FOX immigrant news specialist. He's former director of strategy for David Cameron  who was Prime Minister and leader of the Conservative Party in the United Kingdom. Fox is having a real hard time hiring Americans since no one with a college degree in Journalism wants to work there.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Democratic communist know that public schools are shooting targets   so they hire criminals to orchestrate a massacre so they can get our guns \"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Radical islamic pigs will never dominate.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This mayor should have to live with these criminal gang members that she helped . They terrorize the legal immigrant neighborhoods they live in and this mayor doesn't care because she doesn't live there with them !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" No anne when islam flourishes  violence ensues\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" We don't care what hoops they jump through. We don't want them here and it's our country. Ban islam completely and do it now.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If they know where the illegal criminal immigrants are  send them a notice that they've won a car  or need to physically pick up their \\\"government assistance\\\" and put them on a bus back home.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop these radical islam killers now n the heck with obummer n his love for his muslims killers friends. No sharia law in America if they don't like like go back where they came from. Pro pangs a idiots\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" To the left  republicans are more dangerous than any mass killer. They need to be investigated. Furthermore  the left wants more and more mass shootings  so they can push their people control measures  which they call gun control.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" That mayor from Oakland needs to spend 10 minutes in a confined room with a couple of El Salvadorian illegal immigrants (MS13)....actually the whole California liberal base needs to....Love to see if their way of thinking changes....let alone survive?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" You're going to love this one  almost one year to the day  Rep Hahnfeldt-R  proposed legislation Senate Bill 9 08 that would have eliminated gun free zones which included K through 12 schools. So once again Democrats block it  it dies in committee  and one year to the day we have a shooting that could very well have been prevented or greatly reduced the number of casualties. thank you libs and dems you are anti-American all the way\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Her decision and everything else that is happening are all facets of the seven stages of jihad. Everything from CAIR  to islamophobia to ISIS  etc  etc. Each facet plays of the others. Read up on it. Until we kick em out or kill em  America will be forever different...really already is and will be. Be prepared to not be a victim. Starting now.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Nope  those whining little spoiled brats in Sacramento have not got a clue about reality and illegal aliens as they hid in their mansions. It is a shame legal immigrants and citizens are not afforded the same rights and privileges of illegal aliens by those insane Democrats in Sacramento.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Liberal progression is the enemy  islam just one of their tools.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" americans  killing  more  americans  than any terrorist  or  immigrants  and  you  do nothing.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" It's crucial to enforce the federal law for immigrants now. Less talk more action. Save our California from illegals and comrades protecting them.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" The FBI didn't miss it. They were told to not pick on muslims. We as a country are totally screwed as long as we continue to be whimps where islam is concerned. Reclassify islam as a hate group & not a religion  bulldoze every mosque in this country & give all muslims a free ticket to any muslim country of their choice. Their entire belief system is anti American. Do not call me a hater  they have hated western civilization forever!! Do not call me a racist  islam is not a race. And  again they hate us & want us eliminated. Why the F**k would we invite them here and why are we not already kicking them out?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" All immigrant stores Rob and send money out of US.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Try being in my retired parents who worked for 60 years and get less benefits than illegal immigrants...where the hell do dems live\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" In the Orlando shootings  it wouldn't have made much difference  since the shooter so far can't be traced directly to any one islamic group. The islamic ideology itself  when heard from the radical elements  dictates that homosexuals must be killed.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" We can say with absolute certainty these immigrants with destroy America. Why are we letting them in?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Does anyone here think this tragedy could have been stopped? More guns couldn't have. Less guns couldn't have. A trained arm police officer couldn't stop it. If an American citizen that can legally own guns wants. Commit murder  he cant be stopped. Maybe trumpys wall will stop the next mass shooting. Or Hillary's ban on guns will stop the next one. No politician can stop a legal gun owner from murdering innocents.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This is some of what Pelosi said in her sickening  8 hour tribute to illegals. .... Illegal immigrants are a blessing  they are doing what the Founding Fathers would wish  they are the best of the best  more American than Americans  reinvigorating  they are fabulous  beautiful  and patriotic  yes  very patriotic.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I'm surprised he's not telling them they are islamaphobic....i mean  that's what he keeps telling us.  \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This islamic muslim terrorist is known to the FBI and his father is a Taliban sympathizer. How the hell did this clown not get flagged during the background checks.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Godless President Obama is responsible for shooting in Orlando  FL because he is constantly pushing Sodomy on wrong people. Now he is taking advantage of this bad situation and again he making his Communist effort to take guns away from good American people. He does not mention Radical Islam because this muslim movement is one of Obama's Gestapo effective tool to paralyze Christianity around the world. Obviously Muslim Terrorism works well for Islam. Since 9/11 we got Muslim Terrorists in the White House and expansion of Islam around the world in the name of Democracy.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" But wait  didn't Crybaby Chuck Buy me a drink Schumer & Nancy Change my diaper Pelosi say these people are good & make America a better country ? That's the BULLSHIT they're trying to sell us. I'm sure not a single illegal immigrant lives in the neighborhoods of Crybaby Chuck Buy me a drink Schumer or Nancy Change my diaper Pelosi.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Refugees = islam = isn't a muslim religion = terrorism = TRUE EVIL. What religion  TODAY and NOT from the history  but TODAY goes and molester's children  rapes innocent women  female genital mutilation  beats innocent people for what THEY want to believe  behead innocents  cut off limbs of innocents? I am talking about right now and today  and not Thousands of years ago. Right now the muslin religion is backing all this. Soo you want to say muslin religion is good? Look around you. Who is doing the raping  molesting  beheading  beating? I am talking about the ONLY RELIGION. No it is not even a religion  it is a terrorist organization that is hiding behind the religious logo so to pass by blind and the ignorant. PERIOD. To forgive the terrorist is up to God  to send them to him is up to me. â   Putin\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Hispanics never killed  enslaved  segregated  and hung up black people like white amerikkkans used to do it. So don't be hypocrite and stop saying bullshit. Being you white amerikkkans and trump supporters the ones who want to bring back the 30's and segregation. You're just human garbage. Critizicing black people and saying they're anti-amerikkkan for protesting a pro slavery message and saying bad cops(only bad most of police is good) stop shooting us. Don't change narratives. Bunch of hypocrites.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" You probably had a hand in the FL shootings. no doubt you were at the meeting for it to be orginized\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Aren't you all fed up with terrorism that is supported by your governments  take back control and declare total war on muslims worldwide  this is the final battle predicted by so many scholars   so lets finish it once and for all  there is absolutely no other alternative. They call us islamaphobes for revealing and speaking the truth about  muslim doctrine and what it is  but muslims are allowed to dictate and spew out their hate  murder  rape and torture propaganda doctrine against us freely eveywhere telling us what the will do to us if we don't obey their rules   why is this  these are our countries not theirs?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Black Lives Matters focus is strictly on the police otherwise they would be outraged by all the black on black shootings so if illegals kill a black person it's not there concern because it doesn't fit their agenda. Black Lives Matters is just another phoney fake outrage money making extortion group. There are faults with police force's and officer's all across the country but when you think about it on a daily basis the interaction of the thousands of police officers and that the outcomes of these encounters end with positive results for everyone. So if you think the police are brutalizing people on a daily basis your bias is clouding your judgement.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Pardoning convicted illegal immigrants? You have got to be kidding me. That is so un-American and illegal. What don't you get about the words illegal immigrants?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" 1400 years ago they forcasted the third world war..total confligetation..meaning war everywhere from within..it was a war with islam..\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I'm expecting many more Muslim terror attacks soon. Mostly lonewolves and husband and wife terrorists and children terrorists like The Boston Bombing kids. Oaklahoma Christian woman decapitation by Muslim coworker on the job! And at least 70 islamic attacks during Obamas administration.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" True to the legal immigrants but the illegal ones just gonna be here and cause much distress for you and I\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The take over of America by Islam has begun. THANK YOU OBAMA FOR YOUR STEAD FAST PRO ISLAM POLICES  YOU TRAITOR. The only way to control this type of take over is to vote those that are pro sharia/islam out of office and vote in pro  American Christians. Muslims/islam account for 1 percent of our population. Those that can vote even less. Come on people  this is a no brainer. VOTE  IN CITY  COUNTY  STATE AND NATIONAL ELECTIONS. Beat them at their own game.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" And what is it called when islamist have sex with little boys  OH YEAH GAY\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Lord  reveal all 1400 years of the evils of islam enough beforehand so no innocents are harmed and give a just prison sentence for every criminal act including all who refuse to alert authorities beforehand and after! Remove now from office all government officials who endanger their citizens or mishandle taxpayers money or promote islam and other violence and other evils in any way! Bring repentance toward God and faith toward our Lord Jesus Christ to all!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" when you are going to deport these illegal immigrants who currently live here in San Diego and elsewhere in California? We need action and result  not only just talk.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Then turn about if fair play. Lets start killing islamic leaders.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Every illegal immigrant steals someone's social security number and ID. Why will the media not report this. Because they are protecting the Social security administration. Because they will not report multiple people using same number\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The mayor is an idiot  but he's getting rich off the immigrants! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Waiting for the Democrats to name one NRA member who's committed a mass shooting.....   \"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Death is the sentence for islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Love is based on truth. Without truth you cannot have love and produce unity. Muslim immigrants have no love for Christians because their worldview is based upon a book of hate and murder.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" take away all the weapons that protect the hollywood knitwhits then. how many shootings happened under osama's watch? never was there a movement like this.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Most of these immigrants are not only Muslim but also mental.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I may not agree with the lives led by lgbt community but no one has right to kill them. He is a terrorist and should be taken out\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Democrats are the KKK. Look at the inner city's run by Democrats for well over 60 plus years. And the Black community has absolutely nothing to show for it  poor schools  poor housing and very few good paying jobs. Look at the Black on Black shootings in the inner city's it is an epidemic  and the Democrats say absolutely nothing  because it does not fit there narrative. They want everyone dependent on Welfare and the Government. They want us all to be Victims and they are our savior's. Except they have never been the savior  quite the opposite. They Democrats were and still are the true Party of Slavery\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" xbama must be conflicted him being a islamo-nazi and a homosexual.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is b.s. don't need or want these ppl enough with the immigrant  we the people should vote on who comes in to this country. We have enough people sucking off of us.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Trying to blame the NRA  is total B.S. Of the last mass shootings in the US  how many shooters were known to be NRA members and how many of the weapons used were legally owned by the shooters? Many or most were legally owned and would not have been prevented by any so-called 'reasonable' gun control. None were members of the NRA - which would be touted far and wide were it to happen. All happened within \\\"gun free zones\\\" where law-abiding citizens are not allowed to carry firearms.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Barbarians for sure! - Are Muslims some real sick barbarians? You be the judge by watching this short video:\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" death to islam  NO this NO reason to disarm Americans or call for gun fool safety   that's a LIE     islam and its cult members are the murderers satan worshipers must be removed death to cult islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" These immigrants are spreading diseases!!!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop the islamic plague\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is the crisis Obama has been waiting for...gun confiscation  for our own good  is next with martial law looming ready to be instituted if the election doesn't seem to be going Obamas way....\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Well registered democrats not NRA members are doing all the shooting so maybe you should start with the mental health of your buddies\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ban the cult they follow  exhile them to countries there  seal it off  no funds for islamic countries let them die off\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Everyone was so enraged when Trump said that a Mexican judge was biased against him. People yelled racist  racist  racist even though the judge belonged to a Mexican organization that fought for open borders and illegal immigrants. Not for their country but ours. None of these people who yell racist must have watched as Mexicans said they wanted to take over our country. They must not have watched while Mexicans flew their flag while they burned ours. And most of these ungrateful people were probably living off the taxpayers and our welfare. Are we so blind and politically correct  and multi cultural that we don't even want to believe our own eyes and ears about the people who live off us and hate us at the same time.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" No   Ann not the ONLY reason    another reason of many connected factors might be that Trump is continuing the long range goal of islamicizing America  and that he fooled y'all  lied  and follows the route and script laid out by his political scientist handlers. Surely in the last phases and yet watchmen such as your self keep beating the old drum of  partisan power struggles  or freig policy necessitating our allying with evil for the good of America. This sites monitoring of immigration is not  a news site  you must have  a stand  a position    an idea what is motivating the submission to islam by trump  and Obama and Hillary  and nearly al senate and house   any idea  or   ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The kkk has not been violent in forever lol. They should protect themsevles from eachother. But they wouldn't do things right. They would be doing more drive bys and killing innocent children. Because they spray bullets n hope tgey hit the target. I would love to see more african americans at the shooting ranges. Then maybe they could hit their targets\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" To hell with cair  and islamic terrorist thugs!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The UN caused this and the EU for other countries. Get us out of the UN now. They want to come here fine. Then sterilize them. Anyone receiving government aid has to be sterilized. All men and women of child bearing age. We can no longer continue to support the world for freeloaders. They want a better life fine. But not at my expense. Sterilization would stop the influx of refugees  illegals immigrants and current wlefare receiving people. No more babies or baby making daddies to have the government support their off spring. Mandatory. It doesn't select one over another groupo. No race color or creed is involved everyone gets snipped in order to receive government aid. Our wlefare programs would go down  people would leave the US in droves in order to keep reproducing and thats fine. Just not at taxpayer expense. No more milking the system with children. It works for me\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They never ever should be allowed to be apart of OUR Government  EVER!!!!! It's STUPID!!!!! WE are asking for trouble when WE allow this!!!! As for this shooting  Obozo's dirty hands are a part of this. Because He and His administration sat back and have done nothing but to instigate and divide and have allowed so  so many to come into Our Country unchecked. Never  ever calling an Ace a Spade  NEVER!!! Obozo wants destruction and division in AMERICA!!! And the chickens are coming home to roost!!!!!! They are here!!! No telling how many  because they have come and have been bused All Across OUR COUNTRY in the middle of the night  to every state. And no one is really keeping tabs on them. Because Obozo  with his pen has changed it All. They have rights  but taking OUR rights away. Makes a heck of a lot a sense. TRUMP 2016\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Stop the islamic plague!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Exactly right! Hollywood shares a 100 times more guilt in the rise in school shootings than does the NRA!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Run muslims out of our society  tear down all mosques on our soil  they have admitted time and again their intentions to force their twisted ideology on all societies around the world  it's time to stop islamization world wide!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Justin Trudeau Wears Islam-Themed Ramadan Socks to LGBT Pride Parade - Breitbart http://www.breitbart.com/tech/2017/06/25/justin-trudeau-wears-islam-themed-ramadan-socks-lgbt-pride-parade/\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" cair is a front for the muslim brotherhood which obama supports and has given money to bill and hillary clinton for years in return for their support of islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I think the glorification of violence is definitely part of the problem. Hollywood is quick to blame the NRA  but takes no responsibility for creating some of the environment in which these shootings happened. I think that's a much better way of showing their complicity. Make rap videos  movies  and promote ideas that show women being beaten or demeaned  then try to #metoo your way out of culpability. You can't. That's not to say that women who were harassed  raped  or taken advantage of shouldn't speak  but members of Hollywood try to appropriate movements like that to avoid warranted criticism and responsibility.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" no more frickin immigrants. they do not assimilate\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Can't win. We let in immigrants from ALL OVER THE WORLD. The libs would have a fit if we start testing people for mental illness. They want us to keep illegal felons. Why should we now worry about immigrants with mental illnesses? We let in immigrants with TB  Entero  and hosts of other diseases. If Trump tried to eliminate immigrants with mental illnesses Schumer  or Pelosi would probably try to have him jailed for something. Trump has tried 3 times to stop refugees so they can be vetted  and stopped every time. Either you want people checked or you don't. Make up your minds.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I think every memeber of the house and Senate need to go to a shooting range and shoot an AR15 and a semi automatic rifle along with a handgun. BEFORE they try and ban anything! At least know what the hell you are talking about with yourweapons of war rhetoric.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" CAIR = islam = isn't a muslim religion = terrorism = TRUE EVIL. What religion  TODAY and NOT from the history  but TODAY goes and molester's children  rapes innocent women  female genital mutilation  beats innocent people for what THEY want to believe  behead innocents  cut off limbs of innocents? I am talking about right now and today  and not Thousands of years ago. Right now the muslin religion is backing all this. Soo you want to say muslin religion is good? Look around you. Who is doing the raping  molesting  beheading  beating? I am talking about the ONLY RELIGION. No it is not even a religion  it is a terrorist organization that is hiding behind the religious logo so to pass by blind and the ignorant. PERIOD. To forgive the terrorist is up to God  to send them to him is up to me. - Putin\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They are a cancer and should be aggressively eradicated as such. islam is a cult not a religion.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Death to Islam. Death to islamofasist. Death to liberal fascist.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" this cair bunch is like the group of promuslims in the white house  get rid of these radical islam bacon lovers  they r out to take over america\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This was about the hypocrisy of Hollywood. Nothing more. But even that's sayin' a lot. Tired of these body-guarded  gated-community  illegal immigrant-employing elites telling the rest of us how moral they are and how the rest of us should be living our lives.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" So   islamo-nazi is spelled C A I R.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" What's even worse about the Hollywood thing is they frequently romanticize shootings and bombings of crappy people by victims and/or just decent civilians - sends the wrong message.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" You idiot! Ellis Island welcomed legal immigrants....\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They should be shooting anyone coming across the border who looks like that.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Sheriff of Broward County failed the county 45 times  the police failed  and the FBI failed the citizens of Broward County - the children paid the price for a young man's uncontrolled anger acting out by shooting those he knew were in a gun-free zone   POTUS only stated the obvious  but many radical liberal fascist progressive socialists think criminals obey laws controlling weapons and words of others  while foisting deceptive distortions on society by blaming guns and the NRA as a deflection to avoid the inner problem of mankind... SIN!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Lower to zero  we will be soon getting lots of people from Europe coming to America as immigrants. Talked to a French man who is over 70. With tears in his eyes he told how he is moving to America because France has been lost to the Muslims. He said it's too dangerous to live there. He said it's too late to save France  there will have to be a civil war to save France. He said America is so lucky to have president trump. He said thank God for President Trump. He said whatever country you let Muslims in   they start to demand changes of your laws. They want sharia. Wow what an interesting conversation that was. He was just an ordinary citizen born and raised in France. I wish he'd step forward and talk to the useful idiots  that protect Muslims. Wake up America !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Start shooting\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The Democratic legacy in action  if you look at the last ten major fatalities  mass shooting  they weren't NRA members  they were Demi-loon failures at an epic level.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" TRumps job is to bring in just as many as his predecessors  these plans don't change with every election. TRum ha only restricted for 3 months 7  countries and yet allows the 42 other majority muslim countries favored status as their immigration has increased 5 000 percent in the last 15 years. You people here must be scared out of your wits to be cheering for a hero who obviously intends to trade your rights to islam for his own aggrandizement. Are you all retarded here?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Some people are just so deliberately stupid and.ignorant to see what islam really is...a religion of hate and murder!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The UNs going to hell with islam and the more it insults  threatens and attacks us with its terroristic tactics  the sooner we will send them to the one True God for Judgement.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Bahhahaaaaa! The right thing? Some think it's the right thing to to break the law to protect illegals? This view is skewed and sick. If I as a private citizen did this I would be arrested. Arrest this self important mayor and take it to court. If the illegals are being protected by this sick and distorted mayor  then they should come forward to support her .....protect our borders and keep America safe with LEGAL immigrants.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" ISLAM. Trump-hating feminazis claim that women have it worse in America than in the Middle East. http://www.barenakedislam.com/2017/02/15/what-do-the-worlds-15-worst-countries-for-women-all-have-in-common/    .\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" islam is terrorist cult  not religion.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Shocker! The most liberal and illegal immigrant state had the worst quality of life. Sad news is  I fear Texas will become a dirty lib state soon enough. Not because of policy  but because of immigration.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Outlaw islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" PLEASE  don't bring those horrible barbaric people into our country. Look at what happened at Berkley last night  that was muslim and illegal immigrant rioting and burning everything. Those people are rapists and murderers.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Liberals don't want crime or school shootings to go away   the only use them as a platform   in fact they don't want any real issues solved or Americans to succeed because at the end of the day that's all they are is a  doom and gloom party!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Death to islam! Not one good muslim ever! If you think it's a good one  it is because they are still hiding like their quaran tells them to.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Screw islam.Send them packing\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If Democrats and non-NRA members would stop shooting people deadly school and mass shootings would go down by 100%\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop the islamitzation of America!! Ban Islam in the U.S.  shut down all mosques  shut down all terrorist organizations masquerading as Muslim non profits  and deport all Muslims who do not assimilate American culture! Before we do not recognize our own country and it is too late! If liberals fight this deport them with the Muslims to go live with them!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" What is wrong with a jewish person who supports the democratic islamo fascist party and their policies? Have they decided to be like Soros and betray their people? Their party supported the eventual genocide of their people. They are not jews.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" All these Gun Free Zones pushed and passed by Joe Biden has caused these open invitations to these mad or mentally ill people doing the shooting!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" We all need to write this idiot and let him know he's a traitor. The Muslim refugees are not the same as refugees from Viet Nam or elsewhere. Only Islam immigrants with its own legal code  which they try and impose on the host culture. Trump  will cut their funding?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Condemn her? Ummm shes the poster child for their beliefs. Obama is a liar. The koran is not peace. Do your own research on islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I am starting to think people that want gun control plan  some of these shootings. They kill babies with no problem.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The doctrine of islam is a pseudo religious political system of oppression  violence and rape  and murder.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" egypt is muslim  all muslims fight each other  islam is bloodlust bondage  in satiable bloodlust\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Ironic how all these school shootings are happening seems kind of suspicious to me the left must be loving this helps push their agenda\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" SUPPOSED Refugees = islam = isn't a muslim religion = terrorism = TRUE EVIL. What religion  TODAY and NOT from the history  but TODAY goes and molester's children  rapes innocent women  female genital mutilation  beats innocent people for what THEY want to believe  behead innocents  cut off limbs of innocents? I am talking about right now and today  and not Thousands of years ago. Right now the muslin religion is backing all this. Soo you want to say muslin religion is good? Look around you. Who is doing the raping  molesting  beheading  beating? I am talking about the ONLY RELIGION. No it is not even a religion  it is a terrorist organization that is hiding behind the religious logo so to pass by blind and the ignorant. PERIOD. To forgive the terrorist is up to God  to send them to him is up to me. - Putin\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" They're demonic beings / infected with islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If Democrats stopped shooting people  we could reduce our firearm related murders by almost 70%\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I am glad to see that there is protection provided against islamic devils.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Wow the democrats and liberals are really ramping up there efforts to distract from the clinton tampering with the election investigation. Strange how whenever there is talk involving an investigation into her known illegal activities  some shootings take place to distract the public.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" We are not demonizing a religious faith. This religious faith  islam  IS DEMONIC!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Stop the Islamic invasion. ..stop the war on the American way of life.deport radical islam.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" How can this happen is a gun-free zone summer liberal want to push another gun law is over 360 large pendant in the books now just because of the Florida shooting the latest Bill coming out of the Senate basically bands everything so you local police and the military will have automatic weapons and you'll have nothing no disrespect to the Leo's but... Since when to the Constitution get taken out of the hands of the citizens in shredded by the government\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" You may not think islam is your enemy  but muslims certainly do.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" I wonder if the Communist News Network will call the rifle he an ar15 or Nbc4 in Columbus oh show him shooting a 12ga and say it's a ar15 because they're to stupid to know what an m16 or m4 are\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" What will foil his plans is that moslems will discover the love of Christ and leave islam by the millions. (Once the PC morons stop pandering to 'cultural inclusiveness'). No more FGM or child brides in civilised countries.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" How stupid  not against muslims or islam  just sharia law. They all tie in together! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Out with the chump in with Trump. Bye bye immigrants.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" DACA protected illegal immigrants out committing crimes!End it Now!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This article only enforces the fact that islam is NOT a religion but a totalitarian form of government that is not successful in its own country and wants to take over someone else's country! The ones that suffer are the professional citizens  women and children! Instead of throwing out the government they live under they would rather wage war on other nations and take from them. They have no backbone to stand up for making their own land prosperous! They want to force their ideology on other cultures and enslave them. The US has been there and done that when we separated from The Crown in the 1700/1800! Make ur own land habitable and treat your own people's with respect!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" islam is a death cult of hate and slavery!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Obama is largely responsible for the mass shooting today! It got worse under his administration! He hated law enforcement! Police officers were not allowed to do their job & their hands were tied! Obama has used Gun control to distract people from all his MESS!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" islam a feral cult filled with muslim terrorist\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" We have to protect ourselves from psychotic Democrats who hypocritically goes around shooting people in schools while claiming that guns are the problem.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Beware of islam....Obama's out to make America islamic  Trump is here to make America great again..\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" No more immigrants are you people stupid as well as deaf?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Everyone should carry  the crazy ones will start shooting. And will be killed quick by everyone else... and tomorrow... the only people holding guns will be the sane ones  the libs will be in their safe places crying about Russia. And the criminals and insane will be bleeding out rotting in the streets for all to see!! !\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" islam is a terrorist group. 1.5 billion of them. However I am not terrorized by a horde of cowards that are only good against unarmed women and kids. The only terror I feel is that I won't be able to send at least a thousand of them to hell myself.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" islam is a death cult of hate and death!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Obama and his shadow government is creating all these shootings  put real armed guards in school to protect the children!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Fight the Al Hijrah (immigration jihad) Idahoans. Fight the scourge of islam. No true muslim  faithful to the koran and sharia  can EVER be loyal to the U.S. Constitution. That would be blasphemy. Wake up!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Europe contains some of the stupidest people on the planet. Hitler had no problem forcing them into submission  just like islam is doing.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" We need to abolish FBI   sheriff's. Go back to open carry and let the whole mess sort itself out. They apparently aren't any good at stopping people with guns anyway. They should stick to shooting black people.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" How many more Americans have to die? Is our government allowing the murder of Americans to make room for their muslim immigrants?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" If Planned Parenthood started shooting babies instead of Abortions the Democrats would care about their lives too. Sad!\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Fools. Destroy the problem called islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Follow the money. These agencies get paid thousands per head by the  government for each refugee they bring in. They have sold out America to islam.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" islam the religion of we gonna kill you\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" This is what happens when you allow Globalist like Soreass to control our freedoms with his paid crisis actors.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" time to deport all muslims  death to islam\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" The NRA had nothing to do with the shooting. Typical democratic BS put blame on someone/something else other than where the blame belongs\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Yet didn't stand for the parents of their murdered daughter by a gang member at the State of the Union. Soros is paying crisis actors to speak/act out against guns. Where were they when police were being murdered? Notice you don't hear about Obama  Hillary & Russia any more? Haven't you had enough of these Politics! ?\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Oh a moment of silence from the very dishonest Debbie Wasserman schitz she is loving every minute of this shooting. This shooting is a boon for her progressive terrorist loving agenda.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" What a mockery. After all the babies murdered by abortion with their blood all over these evil people's hands. Now they're trying to pretend they care students killed in school shootings. Disgraceful.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" WE The People ARE the NRA!!! It's just this Liberal type of Agenda that has helped to perpetuate school shootings!! These people are DELUSIONAL!! Vote Republican in 2018 And 2020!! !\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" Why don`t all the dems give up their gun rights if they`re so serious. They seem to be doing all the shooting.\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" I would add to that. Properly vet these people and make sure their identity and their ideology conforms to what we need. Make them sign a waiver to research social media and phones for disturbing stuff. Remember some of these teacher are nuts. Case in point the teacher who was shooting Trumps pic on wall in her class room would not make the grade. No pun intended. No sharia law advocates. No antifa teachers. None that have been to protest that we're anti gun. Ect!\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" She actually has the nerve to question someone else's mental health? After the tweet she said the police officers at the school shooting in Florida didn't enter because they didn't want to CONTRIBUTE to Gun Violence. What kinda drug is she on?\"", "label": "no_hs", "name": "none"}, {"id": 1234, "text": " \" This woman says if your American Trump loves you  can this woman tell us is she and the millions of legal black  white  Brown etc legal immigrant and those born here are the ones she says trump loves  if that is so Great. If you are talking about any one no matter whar color skin you have that are Illegal  trump has problem with Great. Stop trying to use race  have you looked in the mirror lately \"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Maxine  card carrying member of the Russian Communist Worker's Union  attended Farrakhan's isis suppot group  Met with Russian diplomats on a monthly basis. Maxie needs to be recognized for the Con Artist she truly is.\"", "label": "hs", "name": "none"}, {"id": 1234, "text": " \" Sassan K Darian what the hell are you are you shooting up. Your taking to many LSD pills dud. Your mind has crossed over in to insanity ville.\"", "label": "hs", "name": "none"}]